{
    "0": {
        "reliability": 0.93,
        "content": "Mark and Ho are gangsters for a major syndicate. Ho's brother Kit is unaware of his brother's lifestyle and himself is an ambitious police officer. However when Ho is betrayed by the bosses he is sent to jail and his father murdered, leaving Kit marked within the force and bitter towards Ho. Mark takes revenge on those who set up Ho but suffers severe damage to his leg as a result. When Ho comes out of prison Mark is reduced to cleaning up for new boss Shing. Ho and Mark resolve to move on, but Shing has other ideas and also plans to deal with Kit to stop him investigating. With the police and mob closing in Ho, Mark and Kit are forced to take a stand.As part of my build up to see Bullet Proof Monk I have been watching some of Mr Chow's HK action movies again just to remind me how good an actor he is when he is used well. A Better Tomorrow was Chow's big break through from television to movies and also the film that kick started John Woo's career after a couple of commercial failures. The plot is nicely overwrought and has a strong focus on the male relationship of friends and brothers. Honour plays strong in all scenes and it is actually quite involving despite the focus on gun play and action.The action is good but dated. This is to be expected after about 20 years but it does still stand up well. The action is pretty over the top but also well choreographed to appear even more exciting than it is. Happily the plot stands up by itself and the film has a lot less action than later Woo films The Killer and Hard Boiled. I really got into the lives and destinies of the men involved and the strength of feeling and, perhaps, debts of honour, between them was palatable.The strong characters are greatly helped by strong actors in all the leads. Chow is particularly good as he has to play two very different stages of his character and does them both very well (although the supercool part must have come easier to him). Ti Lung is clearly the lead here and does good work even if he is a little too righteous and moral to be a gangster. Leslie Cheung is good after a slow start required by his character. Lee Waise plays a good villain and only the female characters are as weak as they often are in these films.Overall this film is regarded as a classic and responsible for the birth of the genre and certainly the genesis of many Hollywood action movies of today (how many multiplex goers who marvelled over the lobby shootout in the Matrix have even heard of this film?). It has dated a little bit but the action is still as outrageous as ever and still as exciting, despite a slight feeling of seeing it bigger somewhere else. The film's main strength to me is simply the male characters' relationships within the plot they get me involved in the film and make the action even more dramatic.",
        "loc": "United Kingdom",
        "date": "2003-04-12"
    },
    "1": {
        "reliability": 0.84,
        "content": "In the 1980s, Chinese and Taiwanese films stormed into European and American art-house theatres, while for less fastidious audiences, Hong Kong provided cult action films, first Kung Fu pictures then gangster flicks. John Woo became the Crown Colony's hottest director through his kinetic crime flicks that filtered the lyrical violence of Sergio Leone, Sam Peckinpah, and Walter Hill through an Asian sensibility and re-exported it to the States where Quentin Tarantino became a major admirer. Woo's trademarks are the stand-off, where two or more gunmen hold each other at bay, and the ferocious gunfight in which dozens of people are killed and restaurants blown apart as the hero pirouettes and somersaults while blasting away with two automatic pistols to throbbing, synthesized Western music. \"A Better Tomorrow\" is a characteristic fable of male friendship, stoicism, courage, and men living by a personal code, in which women are marginalized. It made an overnight star of Chow Yun Fat, who appeared in most of Woo's pictures. The handsome, reserved, athletic Chow is the epitome of Hong Kong movie cool, a moral man in an amoral world, his character is much the same whatever side of the law he is on. The movie also introduced Leslie Cheung, who was to become an iconic figure in mainland Chinese cinema.",
        "loc": "Winnipeg, Canada",
        "date": "2000-08-20"
    },
    "2": {
        "reliability": 0.84,
        "content": "The relationship between two brothers on opposite sides of the law, and the loyalty of friends is explored in A Better Tomorrow,' an action drama directed by John Woo. As with any Woo film there's plenty of action here, but at the heart of the film is the story itself; and that's what sets Woo apart from all other so-called action' directors. Woo frames the drama with some astoundingly intricate and well choreographed action sequences (gun play and hand to hand fighting), but integrates the story seamlessly, which raises this film, as with all of his films, levels higher than the average action movie. In this one, older brother Ho (Lung Ti) is a high ranking member of a crime syndicate specializing in counterfeit money; his younger brother, Kit (Leslie Cheung) is beginning his career as a detective. Complicating matters is the death of their father (Feng Tien) and the involvement of Ho's best friend and colleague, Mark (Chow Yun-Fat), and Kit's girl, Jackie (Emily Chu). In the end, at the core of the action, it becomes a story of love and loyalty, and the sacrifices sometimes necessary in life to make it work and give meaning to it all. Woo has impeccable timing, not only in the action sequences, but with the drama as well; he knows how to use the camera to heighten the emotional impact of a pivotal moment, and successfully injects a caesura at just the right time, which maintains the perfect amount of tension that extends the drama and serves to hold the audience enthralled. That he can employ these techniques equally within the action and dramatic sequences is why his movies have such wonderful flow and rhythm; it creates a whole' as opposed to merely a series of scenes strung together to tell a story. Directors of all genres would be well served to study Woo's techniques. Woo gets the most out of his actors as well. Lung Ti gives tremendous depth to the character of Ho, successfully conveying the inner struggle of this man attempting to make amends with the brother he loves, while the charismatic Chow Yun-Fat gives a riveting performance as Ho's closest friend. His screen presence is dynamic and commanding. Woo firmly establishes the depth of loyalty between the two, and skillfully the actors make it convincing and credible, which makes the final heroics all the more believable. An exciting, memorable film, A Better Tomorrow' is thoroughly entertaining, and a tribute to a truly great director, John Woo, who seems to get better with every film he makes. For a combination of action and drama, there isn't another director in the history of movies that does it better than Woo. I rate this one 9 10.",
        "loc": "Salem, Oregon",
        "date": "2000-11-09"
    },
    "3": {
        "reliability": 0.93,
        "content": "When this film was made in the 1980's Hong Kong cinema was dominated by wushu films and bizarre swordplay movies involving people flying around and other acid flashback inducing scenarios. John Woo was a young director who had done a string of martial arts films, comedies, and musicals. In 1981 he split from Golden harvest and joined Cinema city, after a couple of comedies, He directed the modern day action film \"Sunset Warrior\" and it was held on the shelf and not released. After the failure of \"Sunset Warrior\" he was sent to Taiwan and directed another two comedies. Returning to Hong Kong, Woo had always wanted to make a modern day gangster film. Teaming up with friend and producer Tsui Hark, they made a film that would inspire countless films for years to come. Casting Chow Yun Fat who was mainly a television actor as one lead, an old school Kung Fu actor in another and a singer in the third lead role, it was a risky venture which paid off. The script is great featuring lines such as \"Do you believe in God?\" \"sure i'm one, you are, a god is someone who controls their own destiny\". There is strong characterisation of the characters, aided on by perfect performances from the actors, The action choreography was excellent and inspired virtually every film made involving guns ever since. It makes you realise that the only thing \"the matrix\" didn't take from this film and it's sequels is the plot. This is one of my favourite films of all time, and if everyone in the world saw this, I guarantee that the sales of matchsticks and toothpicks would soar.",
        "loc": "Sheffield",
        "date": "2002-08-19"
    },
    "4": {
        "reliability": 0.84,
        "content": "John Woo was responsible for creating a whole new genre with A Better Tomorrow in 1986: the heroic-bloodshed genre. ABT is a groundbreaking movie, and Hollowood blockbusters like \"The Matrix\" would never have existed, if it hadn t been for A Better Tomorrow. Chow Yun-Fat was launched into superstardom, after his flawless role in this movie. CYF plays Mark Gor, a Hong-Kong gangster known for his coolness. The actionscenes introduced John Woo s famous twingun-action, and the quality of the actionscenes is very high. The film is VERY violent, and is not recommended for young people. Though ABT is getting a bit old, it can still show American action-directors how to get things right. 7,5 10",
        "loc": "Froland, Norway",
        "date": "2000-05-15"
    },
    "5": {
        "reliability": 0.86,
        "content": "This film just works!! Besides Woo's top notch action sequences, I was amazed by the great story. Chow Yun Fat is great as Mark and Leslie Cheung is very good as Kit. However, I think the main spotlight is on Ti Lung who is amazing as Ho. The story of loyalty amp; friendship is the main emphasis here and is essential. Plus, the chemistry between the actors is so apparent, you can see that they must've had so much fun making this movie.I can see myself watching this again and again...",
        "loc": "Queens, NY",
        "date": "2002-05-21"
    },
    "6": {
        "reliability": 0.78,
        "content": "John Woo's Ying Huang Boon Sik A Better Tomorrow(1986) was groundbreaking when first released because of the stylisitc depiction of the action scenes. Its success spurred a new genre in Hong Kong cinema known as Heroic Bloodshed. These films were usually gangster pics which is characterized by outrageous gun battles, heavy action, and high melodrama. Hong Kong cinema in the mid 1980s to early 1990s was in the midst of a gangster film craze similar to Hollywood in the 1930s-1940s, France in the 1950s-1960s, Japan in the 1960s-1970s, and Italy in the 1970s-1980s. A Better Tomorrow(1986) is to Heroic Bloodshed what A Fistful of Dollars(1966) was to the Spaghetti Western.A Better Tomorrow focuses on the age old themes of honor and loyalty. The characters of Ho and Mark are honorable gangsters in an era of double crosses and mistrust. Ho and Mark are at odds with the changing value system and this puts them as people who are outmoded in their principles. Honor and loyalty in A Better Tomorrow(1986) is greatly emphasized as the marks of a good hearted person. Mark Gor is very honorable and loyal in his personalty compared to Shing who is the opposite.John Woo's main concern is to place high importance on the idea of brotherhood. According to John woo in this film, the tight bonding between men is something that was lost among youngsters at that time. Brotherhood in the film is complex and emotional. The relationship between Ho and Mark is so strong that there is nothing that can smash it. The scene where Mark tells of his ordeals at a nightclub as a first time gangster is nostalgic and touching.Famous for the clothes Mark Gor wears as for anything else in the film. Began a trend in fashion around Hong Kong when many people started wearing the same kind of outfit as Mark Gor. Quentin Tarantino loved the look of Mark that for weeks he dressed like him to feel and look cool. In John Woo films there is always focus on the fashion of his characters. Mark Gor was the Rick Blaine of the 1980s.A Better Tomorrow(1986) changed the look of action films with the famous use of pistols by Brother Mark in the restaurant. The first of many elaborate gun battles that dominates the films that follows A Better Tomorrow(1986). Although John Woo would film many wonderful action scenes in the next few years, there never would be a scene like this one which is full of energy and freshness. I enjoyed it when Mark Gor places guns inside flower pots as backup because the idea is cleaver and original. This scene is parodied in the climatic portion of Just Heroes(1987).Ying Huang Boon Sik(1986) gave stardom to an actor known for his roles in Hong Kong television named Chow Yun Fat. Before the film's success, Chow Yun Fat was considered box office poison by Hong Kong theatre owners. His charismatic and suave performance as the tragic Mark Gor broke that reputation. Chow Yun Fat is the best actor to come out of Asian cinema since Toshiro Mifune and Jo Shishido. He is the most flamboyant actor in the world who is better than any actor that was nominated for Best Actor at the Oscars.The motif of sacrifice for redemption is part of Woo's religious beliefs. The heroes in his bloodshed films perform sacrifices to purify themselves within. The death of Mark Gor is a big sacrifice because it makes Ho and Kit Brothers again. What's sad about the death of Mark is its the only way for Ho and Mark to reconcile with each other. This motif also plays big in The Killer(1989) and Bullet in the Head(1990).The story is simple but compelling. Ti Lung made a big comeback with his role after years of mediocrity. He gives a performance that is deeply emotional and mature. Leslie Cheung also performs well as the headstrong but naive and stubborn Kit Sung. Waise Lee is excellent as the pompous and two faced Triad boss, Shing.Gunfight at the end of A Better Tomorrow is less high body count and refined than in later John Woo films. Still exhilarating and fun to watch. The shootout is filmed in the spirit of Sam Peckinpah and Sergio Leone. When Chow Yun Fat comes out shooting like John Wayne, the film is at a high adrenaline level. One of the reasons why I love this movie.Plot becomes more emotionally intense and less melodramatic with the energetic direction of John Woo. What makes the film work is the large dose of sentlementlty given by John Woo. He films the action and dramatic scenes with much passion and thoughtfulness. He is good at directing Chow Yun Fat and Ti Lung in giving great performances. A Better Tomorrow(1986) made John Woo an action guru after years doing comedies and being known as the king of comedy in Hong Kong cinema.",
        "loc": "Boston, MA",
        "date": "2001-04-20"
    },
    "7": {
        "reliability": 1.0,
        "content": "Two brothers (One a cop played by the late Leslie Cheung, the other a thief played by Ti Lung) become enemies after the death of their father while Chow Yun Fat plays a crippled assassin who teams up with Ti Lung to help protect Cheung from the mob boss that is looking to do him in, while at the same time try to redeem himself in the eyes of his police officer brother. A Better Tomorrow is often reported as the best movie John Woo has done and while it is certainly a superior staple on his resume, the movie's tone is a little off and although the movie is very well done the movie gets a tad too melodramatic at times. However that minor flaw aside A Better Tomorrow provides an unusually rich story that details a rocky relationship that seems to never be forgiven. Indeed even at the end, we doubt whether the brothers will ever be as close as they once were. Ti Lung and Leslie Cheung are very good in their roles but it really is Chow Yun Fat that sells the movie and his performance as an out of work assassin provides a tragic figure that is far more tragic than the relationship between Lung and Cheung. As noted the acting is flawless with Cheung turning in a flawless 180 degree turn in his character. A Better Tomorrow while not the best movie from John Woo, is still a rewarding tale. 1 2 out of 4-(Very good)",
        "loc": "United States",
        "date": "2006-09-03"
    },
    "8": {
        "reliability": 0.72,
        "content": "This movie kick-started many things. The very fruitful partnership between John Woo and Chow Yun Fat, the successful career for of them, the heroic bloodshed movie (don't try this at home or let kids watch them) and a lot of imitators! So one should be really thankful to Tsui Hark, because it's a really good thing he couldn't direct. Otherwise we most likely wouldn't have any of the above! But being as it is, you can watch this movie and see how it is done correctly. Replacement Killers eat your heart out! This movie still is superior to imitators such as the named one or a few others. Yes I know that some have argued that it is dated and other movies (such as Matrix) have not only copied some of it's styles, but improved them. Not for me, they haven't! Because it's not only about copying a slow motion effect here, it's about the story too. And the characters and their believes. And of course the acting!",
        "loc": null,
        "date": "2007-04-06"
    },
    "9": {
        "reliability": 1.0,
        "content": "In Hong Kong, the gangsters Sung Tse-Ho (Ti Lung) and Mark (Chow Yun Fat) are best friends. Ho's younger brother Sung Tse-Kit (Leslie Cheung) wants to be a police officer and does not know that his brother is a criminal. When Ho travels with another criminal to Taiwan for a negotiation, he is betrayed and arrested by the police. Meanwhile Mark kills the gang that betrayed his friend. After three years, Ho is finally released from the prison and returns to Hong Kong. He finds that Kit hates him and is investigating the Mafia and Mark is limped and in complete misery. But Ho promises that he would not return to life of outlaw and prefers to work as taxi driver. However he is haunted by his past and the need of protecting his estranged brother. . \"Ying hung boon sik\", a.k.a. \"A Better Tomorrow\", is a great crime film directed by John Woo. The good storyline about brotherhood, friendship and loyalty is full of action. The screenplay is tight and Sung Tse-Ho is a nice character incapable to regenerate due to the corrupt system. In the 80's, this movie had a greater impact but it is still a great action movie. My vote is seven.Title (Brazil): \"Alvo Duplo\" (\"Double Target\")",
        "loc": "Rio de Janeiro, Brazil",
        "date": "2015-09-07"
    },
    "10": {
        "reliability": 0.73,
        "content": "A Better Tomorrow (1986) was the gangster film that made John Woo one of the top directors in the Hong Kong film industry during the mid to late 80's. This one also made Yun-Fat Chow into a superstar and it revived the career of former Shaw Brothers star Lung Ti and boosted the career of pop singer actor Leslie Cheung. A tragic tale about true friendship and loyalty. Yun-Fat and Lung co-star as two gangsters who are also the best of friends. They have been through a lot together. But a simple twist of fate changes their lives for ever. Leslie Cheung stars as the younger brother of Lung Ti, a straight edge cop who learns about his brother's secret life. Waise Lee and John Woo also appear in this one as well.A ground breaking film. Not only did it make Producer Tsui Hark and Cinema City Ltd. a lot of money, it also spawned two official sequels and countless of knock-offs. A number of triad inspired movies were produced after the success of this film. It also started a fashion trend in Hong Kong. Great stuff.Highly recommended.AFollowed by A Better Tomorrow II and A Better Tomorrow III: Love and death in Saigon..One of your better trilogies.",
        "loc": "Sacramento, CA",
        "date": "2004-06-24"
    },
    "11": {
        "reliability": 0.83,
        "content": "1. The 1980's had some of the most offensive sweaters in history 2. People from Hong Kong give incredibly generous slices of cake 3. An existing permanent leg injury that causes a significant limp can temporarily be relieved by holding two guns 4. Both hardened Triads and fresh-faced young men enjoy pushing, slappy horseplay5. Women from Hong Kong will still answer a ringing phone despite having a maniac shooting at themThis, light teasing aside, is a classic film and still holds up very well after 20 years. Great stuff.",
        "loc": "South Korea",
        "date": "2007-11-10"
    },
    "12": {
        "reliability": 0.8,
        "content": "THIS REVIEW MAY CONTAIN SPOILERS. It's obvious that a lot of people only like Woo's films for the action, and that's fine--nobody before or since has come close to equaling Woo's mastery of action choreography when he was in his prime. But if you look deeper, there's also some meaning to his films.Woo's oeuvre is very much concerned with morality. All of his films deal with issues like the gray area between good and bad, whether loyalty to one's family or one's profession ought to take precedence, the extent to which actions determine one's character, and so on. People criticize his movies for featuring protagonists which leap around in ridiculous ways, shooting endless bullets, never having to reload. They're missing the point, because Woo doesn't care at all for realism. He is more interested in creating a sort of superhero mythology featuring more or less real-life characters that use extreme violence as a means of self-realization and working out moral issues.Anyway, although A Better Tomorrow doesn't actually feature all that many action scenes (although the ones that are here are really good, especially the scene in the restaurant) it's still somehow my favorite of his Hong Kong films. It has heart, the acting by Chow Yun-Fat is really great, and for some reason I also really dig the music. I can't really offer good reasons why I like this one better than Hard Boiled and The Killer, because the action is technically better in those two. But I prefer this one.",
        "loc": "Vancouver, Canada",
        "date": "2004-11-11"
    },
    "13": {
        "reliability": 0.67,
        "content": "Spoilers herein.As an enthusiast of film, I've develop all sorts of rationalizations for attentiveness which I describe to myself as projects. That way, I can report to you on various sub-hobbies -- like the one concerned with style and camera choreography. That's why I sought out this film at any rate: there's a cinematic sub-art associated with the imposition of style on a ballet of gunfights. John Woo is a major figure in this little corner of cinema.My own preference is for less overt choreography, more choreographed cameramovements, more style in the image and less strutting in the character. That's why I prefer Kar-wai Wong. But there were parts of \"face off\" and \"MI2\" whose excess along these lines thrilled me, despite the strutting men.So now we come to what many believe is the earliest successful attempt at Wooist style. Looking at the first films of a master is often pretty rewarding. After all, nearly every film of this type is a bad film, painful in places. So watching one a little less good is no sacrifice: we watch these for moments. And in earlier films those moments are often fresher, more exciting.And that's the case here. There are some really horrid sequences, like the tussle resulting in the father's death. And there's the junky story -- oh and bad acting, even by Hong Kong standards. But there are a couple sequences that are very successful: both involving Yun-fat Chow of course: toward the beginning he takes revenge: and later he steals a computer tape. These are raw, but distinctive. Notice what the camera chooses to see: small lives in each death, small expressions of individuality and character as each person appears on the screen for only a few seconds before they are killed. It is as if Woo creates a kanji character (named Mark!) who spends a second or two creating quick kanji of subcharacters: making them live by taking their lives.Ted's Evaluation -- 2 of 4: Has some interesting elements",
        "loc": "Virginia Beach",
        "date": "2003-06-27"
    },
    "14": {
        "reliability": 1.0,
        "content": "This is the movie that made John Woo the reputation that he has for action films. If you enjoy action films, and in particular other Hong Kong action films then you will enjoy this. Stylistically it is easily identified as a Woo film and doesn't really transcend the action film genre but it does work marvelously within the confines of that genre.Some consider The Killer or Hard-Boiled to be the better John Woo HK film but I find that while the Killer and Hard-Boiled both have tighter, more elegant action sequences what really makes A Better Tomorrow lead the pack is the plot. It isn't an entirely original plot but it is well acted enough that you really feel for the characters and can understand the motivations. It isn't a typical action movie plot where the script serves simply as a device to create interesting action sequences. You get traditional Chinese themes such as honor, loyalty, and strong family ties.As always Chow Yun Fat is a pleasure to watch. He is simply one of the coolest action stars in the entire global movie industry. You could search far and wide and not find a more suave action star than the dual-pistol wielding, cigarette-in-mouth Chow Yun Fat. Worth watching for his presence alone. If you only know him from the American films he has done then you are doing yourself a disservice.In summation: if you like action films you will love A Better Tomorrow. It's that simple. Also check out other Woo HK films like The Killer and Hard Boiled.",
        "loc": "Warszawa, Polska",
        "date": "2012-01-17"
    },
    "15": {
        "reliability": 1.0,
        "content": "Hong Kong movies are not unlike Hong Kong itself: loud, brash, fast, and furious, and the Crown Colony's biggest box office hit is more or less representative of its type, offering unsophisticated escapism with energy to spare. The formula is simple: mimic time-tested American movie clich s, but blow them out of any realistic proportion; the result in this case is a whipcrack action adventure beginning where most Hollywood thrillers end. The sometimes incomprehensible plot follows two underworld 'brothers', betrayed by their own syndicate, who embark on a bloody campaign of revenge against the silky-smooth crime lord (once their apprentice) responsible for setting them up. Separate credit is given to an 'action director', and for good reason: the violence is often incredible, but is presented on an unreal and almost theatrical scale, with lots of balletic slow-motion shoot-outs and artful camera choreography. Even more entertaining are the odd malapropisms in the Cantonese-to-English subtitles of the original theatrical import, in which 'legal evidence' is translated as 'hints', and the macho threat \"don't f ck with me!\" emerges as a somewhat less intimidating \"don't depress me!\"",
        "loc": "United States",
        "date": "2010-11-07"
    },
    "16": {
        "reliability": 1.0,
        "content": "This was the movie that got John Woo Famous. It's a beautifully done film, about a relationship between two brothers that goes wrong when one of the brothers Kit (Leslie Cheung), a rookie cop, discovers that his brother Ho (Ti Lung), is a gangster when he is sent to prison. Three years later, Ho gets out of prison and starts a new life that is crime-free, but his brother is unable to forgive him (in other words, hates him) and his friend Mark (Chow Yun-Fat), encourages him to go back to the world of crime. The storyline is rather complicated to follow but this movie has some great stylised action scenes and great acting.Worth watching.",
        "loc": null,
        "date": "2006-07-27"
    },
    "17": {
        "reliability": 0.67,
        "content": "A Better Tomorrow Is the first film to create the type of slow-motion gun fights that are seen in many films and now video games. But the film is not really a action film as this film is less action-like and more dramatic than most John woo films.As it focuses on two brothers and a young man on the verge on finding a better life.The film has great memorable likable characters, Powerful acting, a great pacing and a Soundtrack that has you tuning for days.The film is about a gangster name Ho who is trying to escape his gangster life to protect and lookout for his younger brother Kit. Kit is a up-incoming police officer who has no idea what his brother does for a career.Ho is given a assignment to go to Taiwan for a deal but is set-up by his driver Shing and Ho is arrested and sent to prison. After hearing this Ho's friend and partner Mark goes to avenge his partner to go to Taiwan to kill the person that set him up.in the process Mark is shot in the leg and left cripple.Three Years later Ho is release from jail and finds out things have changed.His brother has become more bitter and has hatred for his brother for being a gangster and blames him for his father's death.Mark before being a well-known gangster has become a car washer and a bum living in a parking garage.He has thrown his gangster life away and lost it in a blink of an eye and Shing, Ho's old driver is now the boss. Ho is trying to reconcile with his brother but due to his deep-hatred he has for him and now his old gang wanting to get rid of Ho and Mark for being pests things are getting tough in Ho's life.The film feels like a drama film than of a action film. Because half of the film is Kit and Ho trying to accept each other and also Mark's Struggle to come back to his old gangster life and prove he's more than just a gangster than knows how to use two guns.but this drama is far from boring making these characters real and believable as well.As for character development it's on top form.We learn that Ho is a wise, caring man who is looking out for his brother from danger.but goes though a lot because he has chosen to leave the criminal life and lookout for his brother and Mark making him a likable character.Kit is a first a care-free person but when he finds about his brother he becomes a troubled character with a lot of angered inside him and cannot forgive his brother at all for what he has done.Mark is the most likable character in the film from being a Dynamic, fun-free, smooth character in the beginning to a Man trying to become man looking for a better life as well.Thanks to the characters, the acting is in top-shape.Ti Lung gives well performance as Ho as he makes his character believable and bring a level of emotion as well pulling off amount of range.Leslie Chung is great as Kit.as he plays the naive, bitter character well making him into somewhat of a spoiled brat.But when all said and done, Chow-Yun Fat steals the show as Mark.He fits into his role well as the comical Mark and enjoys playing his character despite the fact in the beginning of the film he plays the role a bit over-the-top.But it's his climax performance that steals the show.making you want to crying in his dramatic sense when he tells Ho he wants to be a better man.Overall this is great movie you will enjoy it I'm telling you You will.",
        "loc": "United States",
        "date": "2008-03-16"
    },
    "18": {
        "reliability": 0.67,
        "content": "A \"better tomorrow\" seems like a typical hong kong gangster drama. It is not,it is much more thanks to John Woo! The story has it's moments! But like most of John Woo's movies it is about the action! The three main characters are Chow Yan Fat, Ti Lung and Leslie Cheung. Although Ti Lung and Leslie Cheung give good performances! Chow Yan fat steals the show by far! It is a joy to see him,no matter what scene it is! He is the embodiment of coolness in this movie! It is to bad such a fine and versatile actor doesn't get the chance to make really good movies in Hollywood! As I mentioned before this movie is about the action! The slow mo shootouts are superb. The scene where \"Mark\" kills some bad guys after they betrayed Ti Lung is classic and is parodied very often! You will see why! The setup to this shootout is great! I can go on and on! For that time the ending is extraordinary! It is a prequel to John Woo's later work! Check it out if you haven't done so already! This movie is excellent!",
        "loc": "Netherlands",
        "date": "2007-01-31"
    },
    "19": {
        "reliability": 0.6,
        "content": "I have declared war on 'The Matrix'. The Wachowskis are nothing more than celebrated thieves. Now that their trilogy, in all its idiocy, is finished, I am free to criticize their blatant theft. Why is it bad? Because they borrow elements from lesser, weaker films like this rather than from smarter and more detailed films.How many elements did the Wachowskis steal from Woo--and this movie?--The use of dual (akimbo) guns.--Trenchcoats, sunglasses, other fashion tips.--Slow-motion, bullet-obsessed battles.This might not look like much, but, considering this is the entire structure of 'The Matrix' movies, one can see how weak the structure is. Spielberg at least referenced Kurosawa for 'Private Ryan', that's duplicating a master's work.Woo is a master with creating visual action, and incompetent amateurs like the Wachowskis and Michael Bay won't be competing against him in the future. Woo's only problem is that he has a bad agent.Here is perfect proof of his concern for the image and not the character. 'Hard-Boiled' had the grossly elaborate shootouts. 'Face Off' had visual power to knock it past the competition, temporarily. 'The Killer' is great because it took a simple plot and pumped it up with the style. 'Lola Rennt' did the same. In its thinness, it provides style. Not so here. All 'Better Tomorrow' is useful for is plotting the progress of Woo's characterizations.Chow got the bargain end of working with Woo, subsequently destroyed by Hollywood's misunderstanding of Hong Kong.Final Analysis Midrange Material",
        "loc": "Shermer, Illinois",
        "date": "2004-01-18"
    },
    "20": {
        "reliability": 0,
        "content": "Before Broken Arrow hit the silver screen with John Travolta, and Christian Slater, there was this wonderful gem to come out of Hong Kong. Chow Yun Fat, was his absolute best when he starred in this gritty, and action filled segment about the criminal underworld. Two brothers... one a cop, the other brother is part of an organization that deals in counterfeiting, as well as drugs, and weapons. Lung Ti who plays the corrupted prince is betrayed, and sent to prison in Taipei for dealing in counterfeiting by one of his own men behind the curtains. Released after... he decides to try, and patch things up with his younger brother who had graduated from the police academy but things do not go to plan.Ostracized Sung Tse Ho tries to adapt back into the social status as a cab driver to make an honest living, but the dregs led by the new head of the criminal underworld (Waise Lee) or Shing who had betrayed him wants Ho back into the fold. Marred by his past Sung finally realizes his worth by protecting his brother at all costs by stopping Shing with damming evidence which he hands off to his younger brother. Mark (Chow Yun Fat) helps him regain his dignity through some heavy fire fighting, as well as taking a severe beating by Shing and his gang.For nineteen eighty six this was one of the most emotional films to date to come out of china. Nearly every movie that does hold a monotonous amount of one dimensional Kung Fu battles or gun fights to outweigh the story line. I found none of that nonsense in this rare movie. Chow, Lung, and Leslie Chung all had great parts to play. A trio in fantastic ranges of acting that made this wonderful tale one of my favourites. It then led on to other films for which Chow Yun Fat became as classic icon using his body style, and gracious persona to coat the silver screen with his incredible talent.For those who love good cop stories this one is it. Betrayal, deep bonding friendship, corruption, action, and emotional baggage for the more intellectual mind can appreciate in a great story. Ten out of ten stars.",
        "loc": "Canada",
        "date": "2017-02-07"
    },
    "21": {
        "reliability": 0,
        "content": "Chow Yun Fat plays Mark, respected member of a major counterfeiting syndicate and best friend of fellow criminal Ho (TI Lung), whose brother Kit (Leslie Cheung) works on the opposite side of the law as a cop. When Ho travels to Taiwan on business, he is double-crossed and, after a shootout, makes a bid for freedom; meanwhile, a rival gang member tries to abduct Ho's father to ensure Ho's silence, an act that leads to the old man being killed.Ho eventually surrenders to the police. After learning of his friend's incarceration, Mark seeks revenge, killing the leader of the Taiwanese gang, but receiving bullet wounds to his leg in the process. By the time Ho is released from prison, the now crippled Mark has been reduced to cleaning windscreens. Ho is determined to give up his life of crime and try to make amends with Kit, who holds him responsible for the death of their father. Unfortunately, syndicate boss Shing isn't about to let Ho go, which leads to Ho and Mark having to take drastic action.The Killer was the film that brought John Woo and Chow Yun Fat to the attention of an international audience, but it was this film, made three years earlier, that saw them score their first hit together with a home crowd, making them both major league players in HK cinema. A Better Tomorrow might not be the all-out exercise in ballistic action that was The Killer (or, of course, the bullet-riddled Hard Boiled), but it does establish the style and many of the themes of their later films. For Woo Fat fans, that should be recommendation enough.",
        "loc": "Hampshire, England",
        "date": "2016-08-23"
    },
    "22": {
        "reliability": 0,
        "content": "Director John Woo's first big breakthrough movie and still considered to be one of the best Hong Kong action movies. A movie that helped popularizing Hong Kong action in the West and is still, after multiple decades, an iron hard nailbiter.Sung Tse-Ho (Ti Lung) is a member of the Triad in charge of their money deliveries. With him he has his trusted partner Mark Lee (Chow Yun-Fat). But things take a turn for the worse when his last deal goes south - don't they always - and he is caught by the police, thus letting his younger brother Kit (Leslie Cheung), a freshly graduated police officer, know about his criminal tendencies. And thus Ho's life is completely ruined, for even when he gets out of prison, he has lost his position in the Triad, his brother has cut all ties with him and even his partner isn't doing as well as he used to.What I like the most about this film is its ability to mix crazy, completely wild action scenes with scenes of surprising depth and character. Ho and Mark's struggle to regain their footing and position in the world is very identifiable, and Ho's willingness to at least try to straighten up makes him an admirable character. We also have Mark, whose character arc isn't as defined and deep, but who works as a good counterpoint to Ho because of his innate coolness and entertainment factor.John Woo is a legendary name in the action genre, and for a good reason. All the fight scenes are amazing, the special effects have withstood the test of time surprisingly well and you're never lost in space, even though the fights are very energetic and fast-paced.Woo has an instantly recognizable style and if you haven't seen any of his movies, this is a great place to start. It has it all. Great characters, even better action scenes, scenic locations, high stakes and boiling tension. Definitely recommended.",
        "loc": "Helsinki",
        "date": "2016-02-14"
    },
    "23": {
        "reliability": 0,
        "content": "This movie contains what is probably Hong Kong actor Chow Yun-Fat's signature role, Mark Gor. He plays a triad member who teams up with gangster Sung Tse-Ho (Lung Ti) in running a counterfeiting ring. However, a double-crossing sends Ho to jail and Mark injured from a gunshot to the leg. Complicating matters is that Ho's brother Sung Tse-Kit (Leslie Cheung) is a graduate of the HK police academy, whose career as a cop might be tarnished by Ho's crimes.This movie has a powerful plot from start to finish, from the intense drama between the two brothers (Ho wanting to go straight and Kit wanting to have nothing to do with his older brother) and the downtrodden Mark, who, after his injury, yearns to have Ho rejoin him in reviving their crime syndicate. The addition of Emily Chu as Jackie, Kit's girlfriend, gives this intense story a little tenderness, as Jackie wants to lead a quiet life and wants Kit and Ho to make peace with each other. There is also plenty of mind-blowing action, most notably the scene where Mark duns sunglasses and a trench-coat, blasting away a bunch of gang members mercilessly with two shotguns at a restaurant. There are many more gun action scenes, some to the point that is a little overkill. The scenes leading to the climax could have been a little more captivating. But yet overall, the ensuing drama and the powerful acting makes this one of the most iconic Hong Kong action movies.Grade B",
        "loc": "California, USA",
        "date": "2014-11-25"
    },
    "24": {
        "reliability": 0,
        "content": "I had already fallen in love with Chow Yun Fat from seeing the incredible Hard Boiled, Full Contact, The Killer and many others back in the early 90's. So I was quite late in seeing the film that really helped launch him as the heroic bloodshed action star!An absolute gem of a film that will always be remembered and loved by many fans of Asian (and non-Asian) films. From the first time I watched it, right up until the last, A Better Tomorrow stands proud as a classic piece of entertainment. Action packed, fun, gritty and beautifully directed this film is recognized as the one that put Chow Yun Fat on the action map, and it's easy to see why His stunning performance as 'Mark' gave cinema one of its most memorable characters, which paved the way for a collection of tributes and spoofs from other HK film-makers that still runs to this day. The awesome Ti Lung (I find) doesn't usually receive the same amount of credit for his role, yet plays his part flawlessly, delivering beautiful action to lump-in-the-throat drama, as he carries the story between his best friend (Mark) and his brother, played by the late, Leslie Cheung.At first, I wasn't too keen on Leslie Cheung as Kit but after warming to him in other movies, and repeated viewings of ABT you soon see that Woo and Hark made the right choice in putting these 3 together on- screen. This is, without a doubt, one of John Woo's finest moments, and one of my all time favorite movies.It should be one of yours too!",
        "loc": "United Kingdom",
        "date": "2014-06-30"
    },
    "25": {
        "reliability": 0,
        "content": "A Better Tomorrow is the first true John Woo movie. It's the first film that he made where he felt that he actually had creative control over it. He made a few films prior to this such as The Young Dragons, Hand of Death, and Laughing Times but this is the first film that employed the John Woo trademarks that he's famous for. But with all that being said, does it still hold up after all these years? Let's find out!Firstly, the story. The story here is the usual John Woo crap about loyalty, friendship, honor, and redemption but the thing that makes it different is that our protagonist isn't actually Chow Yun-Fat despite him being in the DVD box cover. He's more of a supporting character this time and the main focus is on a character named Ho Gar, who is an ex- money counterfeiter who tries to reconcile with his cop brother, Kit after being released from prison. There's also a lot less action here than you expect. The film focuses more on its characters and I actually prefer it this way because I find these characters compelling.The drama in this film is what I latch on to because Ho is actually a very sympathetic and relatable character. He's a good man who cares for his brother but made some mistakes in the past that haunt his present. He could've just been played by some douchebag who just makes puppy dog eyes the entire time but Lung Ti just has this natural look on his face of guilt and remorse that makes you instantly feel sympathy towards him. His character in this movie goes through an arc where he learns that he has to use violence to deal with his problem. At first, he tries to just have a normal life since his mob days are over but when Shing(a mobster who was an apprentice of him) decides to ruin his life by hurting those he cares for, he has ultimately no choice but to fight them head on. It's a great arc for him because it makes him redeem himself in the most unconventional way possible which is by killing Shing and allowing himself to be arrested again showing that he is sincere about his desire for redemption. In other movies, he would just die protecting Kit as his redemption(which would've been horribly clich ) but here, it's unique and more touching as a result.The performances here are mostly great. As I've mentioned above, Lung Ti is great in this movie but everyone else is also great. Leslie Cheung plays his role well with determination, anger, but also a sense of youth and inexperience in his work. While Chow Yun-Fat doesn't get as much screen time as expected, he plays his role well with a sense of honor and chivalry. Listening to him deliver his speeches in this movie will make your balls drop. The one performance I'm not too crazy about is Emily Chu as Jackie. She's just really whiny and irritating the entire time and doesn't do much outside of just whining. Still, everyone else was great.The action sequences here aren't as big or as well-choreographed as his later films because of the budget limitations but they still work because you care for the characters and that's what's important. In Hard Boiled, I had a difficulty latching onto the characters so I didn't care about the results of the gunfights which made the action feel unexciting despite how well-choreographed they are. So the action in this movie still works for me despite not being as epic as The Killer or Hard Boiled.The score is great. I love how 80's the music sounds in this movie and it gives the film an identity. The theme for Mark sounds really awesome in the action scenes and the sad music for Ho adds a lot more emotion to the scene without feeling too melodramatic. All in all, the music in this film was great!However, I do have some issues with this movie. I feel the pacing is a little too quick at times and I wish they would slow down sometimes. Also, it isn't a very good-looking film because of the budget limitations. Lastly, I have some difficulty understanding Shing's motivation. He betrayed Ho in the past and got him in jail but now he wants Ho to work with him? I just don't get it.Overall, though I think this is a great film with good drama, good action, great score, and is just entertaining as a whole so I'll give it a 8 10.",
        "loc": "Canada",
        "date": "2013-08-31"
    },
    "26": {
        "reliability": 0,
        "content": "MAY CONTAIN SPOILERS OK, to start this off; I saw this film after being gob-smacked after watching Hard Boiled. If this film helped kick start the heroic-bloodshed it must be good! So I picked it up and watched it and I must say, this is a great film! It's about a criminal brother who is siblings to an Inspector. But the next day takes a turn for the worse as he is betrayed by a counterfeit cash dealer in Taiwan, after a lengthy escape Sung Tse Ho finally gives up and is arrested by the Taiwanese police and jailed for 3 years. Later that night Ho's father is killed on orders of the Taiwanese dealer and Ho's true identiy unfolds. After Ho is released he starts working for a Taxi company. Later that day he discovers Mark (Ho's best friend and partner in crime)has become Shing(a once low ranking member of the organization Ho was in turned Boss)'s errand boy and is rewarded after cleaning his car HK 10. Ho later re-unites with Mark and they are around to take back their organization! Will they succeed?",
        "loc": null,
        "date": "2012-04-08"
    },
    "27": {
        "reliability": 0,
        "content": "This movie brought John Woo to the attention of the filmmakers, while The Killer made him a legend (though I feel that A Bullet in the Head is a far better movie). What is really weird is that all of these superb movies come from the mind of somebody whose greatest desire is to make a musical. Weird.Anyway, A Better Tomorrow has a lot of themes ranging for sibling struggles, to redemption, to betrayal. I don't really want to say sibling rivalry because it suggests that it is a crappy American comedy. The rivalry is not about two brothers bickering but instead it is about the burden of the family. Anyway, the themes that we see here are similar to themes that we see in other Woo movies, (Face Off Redemption; A Bullet in the Head Betrayal; The burden of the Family To Catch a Thief). This movie sort of started it all off, and Chow Yum Fat dies (as is expected in most Woo movies, except for Hard Boiled).This movie is based around three people, two brothers, Kit and Ho, and a friend, Mark. Kit is an ambitious police officer while Ho and Mark are members of the triad and are ambitious there. Ho is connected with a major counterfeiting ring and knows a lot of contacts while Mark is Ho's partner and in a way, bodyguard. Ho travels to Tiawan and when he is there he is betrayed by the bosses son and spends the next three years in gaol. News about this gets back to Hong Kong and Kit is denied a promotion because of the connection that his brother has with Triad. Mark, angered at Ho's betrayal, storms the a Triad controlled restaurant and kills everybody there, but is seriously injuring him in the leg and leaving him a cripple.This is not a bright movie. Each of the characters are struggling with their weaknesses rather than basking in their strengths. Mark cannot walk without a brace while Ho simply wants to lead a good life while is past is constantly trying to pull him back into the world of crime. Kit desires to be a great cop but is held back because of his brother and holds a great amount of anger towards him. This becomes the focus of the movie as Ho attempts to reconcile with his brother while his brother not only continues to reject him, but also tries to let go of a past that refuses to let go of him.This is a very bleak movie and there seems to be little way of solution. There is a huge gunfight where the bad guy is killed, but Ho is still wanted by the police and is still looking at a long time in gaol. The only redeeming feature is that his brother finds forgiveness in his brother, and this is revealed by Mark, who gives his life so that the broken relationship may be mended.As I write this, I come to see some huge reflections of Christianity here. It is subtle but it is there. We see that Ho is constantly seeking forgiveness but his brother refuses to give it to him, and no matter what he does Kit is blind to Ho's pleas. We see here the reflection of the fact that no matter what we do, we cannot get into God's good books. We have sinned and because of our sin we have angered God and nothing that we can do can wipe out these sins. Also the death of Mark reflects the fact that Christ, a third party, died for the sins that we have committed. Christ's death, like Mark's death, brings us into relationship with God. After Mark dies, Ho kills the Triad boss that is forcing him to return to a life of crime, thus removing that side of his life. This reflects us as well for without God sin is constantly trying to drag us back down into our old way of life. No matter how hard we try we cannot escape sin. It is not until we accept Christ's death that we can do something about sin, and we see it here with the death of the Boss.We must also look at the title of the movie as well because sometimes the title reflects what the movie is about (actually the title should tell us what the movie is about, though sometimes it is pointless). Here the title reflects Ho and Mark's desire to flee their life of crime and to find fulfillment in a straight life where one does not fear betrayal, prison, or death. A better tomorrow is what they seek, but tomorrow never comes so it seems to be a goal that is unreachable. Mark becomes little more than a window cleaner who must pick his earnings off of the side walk while Ho drives taxis and has a criminal record.Some of the lines of the movie really drive these ideas home (though the subtitles on this version sucked - they seemed rushed and were full of spelling errors). The strongest line is when Ho is told that a bad guy for a day will never be good again, once you sin you can never get back to righteousness. Ho does, but Mark had to die for it to happen. And then he is told that his sin not only affects him, but also his brother. He cannot go from Black to White, but by what he does he drags his brother from white to black.A Better Tomorrow is an awesome movie, but what would one expect from John Woo. It is deep and simply not a movie that one can casually watch. One needs to concentrate to understand the concepts that Woo is pushing through the movie, and the deep characters remove the need for action.",
        "loc": "Australia",
        "date": "2011-10-14"
    },
    "28": {
        "reliability": 0,
        "content": "This is one of those rare films that keep your attention from beginning to end. The action scenes are among the best and like its sequels and films The Killer and Hard Boiled show you, Chow Yun-Fat And director John Woo are the best action film combo ever!The one thing i enjoyed about the action scenes is that it seems more real than just about anything Hollywood has made in the last 25 years. The gunfire sounds more realistic and the car chases are not as choreographed as many big Hollywood films (the Bourne films are a rare exception). You just get this feeling of realism which is why true action fans love all his films.Watch this film and you wont be disappointed.",
        "loc": "United States",
        "date": "2011-07-25"
    },
    "29": {
        "reliability": 0,
        "content": "An excellent movie. I love John Woo movies a lot because of the action. But A Better Tomorrow is one I didn't actually love for that reason. It does deliver action, and it's the graceful, balletic stuff that we expect from Woo, nothing less. But there isn't as much of it, and this is a good thing, because this is A Better Tomorrow, the story of two brothers, one a criminal, and one a cop, and how their different lives tear them apart. And then there's Chow Yun-Fat, who stars in the movie that practically started his entire career. This is one of his best performances, the charismatic, smart alec Mark. Did I mention, he is super, super cool. The movie isn't really even about him, yet he steals it completely. The script is well written, the melodrama that is now classic Woo may not be for everyone, but for devoted fans like me, it is just art in action. Everyone here does a great job acting, our two lovable gangsters Ti Lung and Chow Yun-Fat. Our young, bright spirited cop Leslie Cheung. The ever friendly Kenneth Tsang. And evil bad guy Waisse Lee (I hope I spelt that okay). All these characters are incredibly memorable, and the way they are at the end of the movie is quite different to how they were at the beginning. The story progresses at a nice pace, the action never intrudes, and comes in balanced doses. The story is the real star here, I just loved it, it's a shame that the sequel didn't love up to the grandness that is the original A Better Tomorrow. This movie made history, it would be a shame if you didn't go to your local video store right now and buy this movie.",
        "loc": "Australia",
        "date": "2011-05-15"
    },
    "30": {
        "reliability": 0,
        "content": "After watching two of John Woo's action flicks (Hard-Boiled amp; The Killer) I decided to check out another one of his classics 'A Better Tomorrow'. And while I wasn't a fan of its fewer action sequences ad slower paced style, at first, after re watching the film I think its probably Woo's best.I think the reason I disliked at first was the fact I was expecting a huge over the top actioners like Hard-Boiled and The Killer. But this film is a heroic bloodshed crime drama and focuses on the characters and emotions rather than the action (Which is still fantastic). Plus, it was dubbed...nuff said.The plot revolves around the big boss of a professional counterfeit business named Ho. His brother Kit however is training to be a cop and is unaware of his brothers business. Ho's best friend Mark (Played by the legendary Chow Yun-Fat) works with him as a professional killer who despite his occupation, is a very loyal and caring friend. After a betrayal during a bust, the three characters change over the course of three years and have to go through a lot of hell to deal with their new lives.All the characters keep your interest throughout and feature some really well acted emotional scenes. Ho is constantly struggling to deal with his brother, best friend and the triads he used to work for. Kit becomes a stubborn cop who doesn't know when to let things go. And Mark, one of the coolest characters ever has to deal with struggling life and helping his best friend. Chow Yun-Fat's trademark trench coat, sunglasses and match stick in the mouth increases the appeal of the film.The action scenes, though not at their peak(As said above) are some of the best around at the time of the film's release and are just as cool as ever. Duel pistols, exaggerated blood and ballistic shootout, all trademarks, Woo would later be famous for, appear here for the first time and influenced action cinema to this very day.The film is shot is such a classic fashion but also unique in many places of the film. The soundtrack for the film is also amazing, some of the best film music ever. More could be said about the film but I think this is a film you just have to see. But if you are going to see it, make sure you watch the Cantonese track with subtitle as the dub ruins the emotional moments. Also some DVD's don't have the original soundtrack, so be aware before you buy. Netherless, A Better Tomorrow' is one of the best films I've ever seen and is a definite must see.",
        "loc": "England",
        "date": "2010-10-04"
    },
    "31": {
        "reliability": 0,
        "content": "I had heard so much about Better Tomorrow.I finally got around to watching it.This first film marks Chow Yun Fat's most famous debut and also started the partnership between him and director John Woo, they would later make classics such as Hard Boiled and The Killer together.Chow isn't really the main character in this film, but he does have a good role.The film is about a gangster who wants his brother to join the police force and not follow in his footsteps.His brother does not know of his gangster ways.After their father dies, the brother blames him.The man quits the traids and starts working as a mechanic, however their old friends want him back.Chow Yun Fat plays the brother's friend who helps him out.Overall, while not as good as Woo's later films, it is still a fairly good action drama that is worth watching.",
        "loc": "Canada",
        "date": "2009-03-07"
    },
    "32": {
        "reliability": 0,
        "content": "To Western mainstream audiences, the great John Woo is probably most famous for barely mediocre blockbusters such as \"MI 2\" or \"Paycheck\", but to all true lovers of cinema, he will always be the genius behind the Action Thriller masterpieces that he made in his Hong Kong Days. The Hong Kong Cinema of John Woo includes some of the most amazing action films imaginable, as Woo mixes ultra-violent nonstop action and brutality with compelling plots, touching drama and often overwhelming beauty in a most masterly manner. \"The Killer\" (aka. \"Dip Huet Sueng Hung\", 1989) is such an amazing film, and so is \"Ying Hung Boon Sik\" aka. \"A Better Tomorrow\" of 1986. \"A Better Tomorrow\" is a compelling, violent and beautiful film that delivers everything one might possibly desire in Action cinema. Woo delivers the fascinating, sometimes sad tale of two brothers on different sides of the law with all imaginable beauty in its story, and all imaginable adrenaline, blood and brutality in its violence.Ho (Lung Ti), a former gangster who has just come out of prison, tries to start a new life and reconcile with his younger brother Kit (Leslie Cheung). Kit, however, is a young police detective, and having an ex-con brother gives him a hard time in his job, for which he hates Ho. Ho is torn between the love to his younger brother, and the loyalty to his best friend and former partner in crime, Mark (Chow Yun-Fat), who has become more and more run-down since having been shot in the leg... As mentioned above, the film is often incredibly brutal (and equally stylish) in its depiction of violent action. \"A Better Tomorrow\" includes one of the most violent and brilliantly stylized shootouts ever seen in cinema, as well as countless other amazingly violent action sequences. The film also includes some unforgettably classic, typically hard-boiled Hong-Kong crime-flick dialogue, as well as many amazingly subtle and dramatic scenes. Lung Ti is incredible in his role of the weary ex-gangster who just wants to make his peace with the world, incapable of leaving his past behind. Equally great is Chow Yun-Fat who delivers a brilliant performance (as always) in the role of the down-and-out tough-guy. The late Leslie Cheung, who was a famous singer in Hong-Kong, is also very good in the role of the young cop Kit, and Emily Chu fits in very well as his sweetheart. The supporting cast includes several notable actors, such as Kenneth Tsang and Waise Lee, as well as cameo appearances by director John Woo and producer Hark Tsui. Whether one likes this kind of cinema or not - it is undeniable that in Action cinema, there is nothing quite like John Woo's Hong Kong masterpieces. Like hardly another action director, Woo accomplishes to combine breathtaking, ultra-violent and uniquely stylized action with compelling drama and occasionally sheer beauty. No lover of cinema should allow him- herself to miss the greatness of the cinema of John Woo, and, along with \"The Killer\", \"A Better Tomorrow\" is doubtlessly one of the top-priorities in this great director's repertoire!",
        "loc": null,
        "date": "2008-12-04"
    },
    "33": {
        "reliability": 0,
        "content": "Though I've seen very few Asian films, I really enjoyed this one! Action packed, but still serious and thought-provoking to some extent. One problem I had was that it was either poorly written, or the subtitles were poorly done in some places. A lot of those lines were beyond horrible. Overall, that didn't detract too much from the movie though....Mark has got to be one of, if not the coolest characters I've seen from an Asian movie. The actors all seemed to do a good job, though I find it hard to tell for sure considering I was reading the subtitles. The plot was complex and well-thought out, and I quite enjoyed the ending. If you are either familiar with the original language, or don't mind reading some poorly written subtitles...check this one out! 8 10",
        "loc": "Canada",
        "date": "2006-03-12"
    },
    "34": {
        "reliability": 0,
        "content": "A Better Tomorrow is one great movie. It is a fantastic mix of drama, action and crime movies. Big fans of any of those genres will enjoy this movie.An interesting thing about this movie is that it is a lot more character and story driven than other John Woo films. There are a lot less shootouts in A Better Tomorrow than in other Woo films but the ones in this movie still have the same excitement value. Another interesting thing is that even though he is all over the covers and posters of this movie, Chow Yun-Fat is not actually the main character. I think that the reason of this is that he gives an outstanding performance as his character Mark. Chow Yun-Fat does the best job acting here, but Lung Ti and Leslie Cheung do a great job as well. The characters in this movie develop a lot through out and the actors handle this very well. a Better Tomorrow is definitely a well acted movie.A Better Tomorrow is a must see movie. Not just for gangster or action movie fans, but for everybody.",
        "loc": "New Zealand",
        "date": "2005-12-11"
    },
    "35": {
        "reliability": 0,
        "content": "This movie showcases Chow Yun Fat, Ti Lung, Leslie Chung and John Woo at their prime. Out of all of the protagonist(bad guy is good guy) movies that Chow Yun Fat has stared in, this probably is the best. The story is really good; however it is not social issues that make this movie the movie that it is: brotherhood, loyality, and trust. the problems that the characters have to face, Kit's problems to excel in the police force because of his brother, Mark's delima with revenge and ultimately Ho's struggle to leave his past life as a thief, and regain a normal life. With utmost respect, this movie represents Hong Kong cinema at its best.",
        "loc": "United States",
        "date": "2005-04-07"
    },
    "36": {
        "reliability": 0,
        "content": "It's funny how all the amazing crime action films we see today such as 'Goodfellas'' Reservoir Dogs' and 'Heat'are some of the greatest to ever come out of Hollywood, but then i realize how no one remembers films like 'Hard Boiled','City on fire' and of course the Better tomorrow series! which are just some of the not only excellent HK films ever made but probably the greatest of all kick-ass action flicks. A better tomorrow is incredible and one of my all time favourites, not just because of its amazing violence and cool gun play but because of Woo's genius directing, the friendship and brotherhood which i think makes the characters like Mark lee (Chow Yun fat) and Kit (Leslie Cheung) so likable. It is also easy to notice the way how people like Martin Scorsese and Tarantino get their influences from. Obviously if your not a fan of the HK genre this will not appeal to you, But if your an action fan then don't hesitate this film is a gem!",
        "loc": "United Kingdom",
        "date": "2005-03-10"
    },
    "37": {
        "reliability": 0,
        "content": "What makes A Better Tomorrow so great? The cast is absolutely brilliant. Legendary kung fu sword film star Ti Lung proves his fine dramatic range with an excellent performance as a Ho, a gangster trying to change his ways after his father's brutal murder, and trying to prove to his younger brother he's sorry. His brother Kit is played by the tragic Leslie Cheung, and he gives the role a sad intensity that brings the drama to life. What an incredible scene when Kit sees Ho for the first time after their father's death standing in the rain, and proceeds to attack him. It's hard to remember just how great the aforementioned two actors are in this film because of Chow Yun Fat's film stealing performance. As the charismatic, gunslingin' Mark, Yun Fat became the biggest star in Hong Kong cinema. His dark trench coat sporting, sunglasses wearing, akimbo berretta ways have influenced modern action cinema to no end, and continue to do so even now. Mark's two-fisted assault on the restaurant is still the greatest gun action scene ever. Here's an incredible action movie, with outstanding performances, searing drama, and way over the top action scenes. What more do you want?",
        "loc": "the west",
        "date": "2004-03-26"
    },
    "38": {
        "reliability": 0,
        "content": "the movie has a powerful plot with a powerful performance all around.the movie emphasizes on betrayal and what the next step is to do from thereon. after Ho is betrayed by his younger \"desicple\" and spends 3 years in jail, his dear friend Mark is after vengeance of Ho's betrayals. Unfortunately he's injured for life and loses his position and rank in the gangster world.Ho is finally released after 3 years, but things have changed, his younger brother Kit who is a cop cannot condone Ho's past life style of being a gangster, and he blames Ho for a tragic event (i'll let you guys see that for yourself)MINOR SPOILERS the movie in my view is a big success like many of john woo's other movies because of the unpredictable ending, it doesn't always turn out for the better, in fact it is tragic just like John Woo's - The Killer which too stars Chow Yun Fat, and he dies at the end of the movie, but it is because of this \"reality\" that the hero doesn't always ultimately survive that makes it more real MINOR SPOILERSHo now has to try to convince his brother that he has chosen a different path in life and want him to accept him, but Kit has a hard time looking over thisthe movie delivers good action, and yes this is of course a given seeing it that John Woo directed the movieif you want to see some good action and a GREAT story line (this is very rare to come in a combination) then get this movie! and get john woo's - the killerfancy but nonetheless entertaining action with the exchange of bullets.",
        "loc": "United States",
        "date": "2002-09-06"
    },
    "39": {
        "reliability": 0,
        "content": "A Better Tomorrow stands as several first in cinema. It's the first big film for action director John Woo. It's the first big film for action star Chow Yun-Fat. And it's the film that catipulted Hong Kong cinema onto the international market. The shootout scene in the middle of the film is an absolute classic.",
        "loc": "Wherever, Idaho",
        "date": "2002-06-14"
    },
    "40": {
        "reliability": 0,
        "content": "Spoiler John Woo has created a modern action tale to rival all others. Not only is this film loaded with action and lots of Chow Yun Fat, it has an amazingly great plot. Two brothers torn apart by their father's death, a betrayed mob boss, a friend crippled while gaining vengeance, this film's got it all. It's an instant classic upon the first viewing. A Better Tomorrow is the Hong Kong equivalent of The Godfather, and Chow Yun Fat is finally getting the recognition he deserves as an international superstar. It's too bad his character dies, but it certainly adds to the \"epicness\" of the film. This is John Woo at his best and should be seen by all, not just action fans. The action and the drama create a perfect balance within the film and allow for a larger audience. Don't bother with the sequel as Woo has disowned it.",
        "loc": "Kentucky",
        "date": "2001-11-04"
    },
    "41": {
        "reliability": 0,
        "content": "These 2 guys are just amazing in this film. A true gem. The opening scenes of Chow in that black coat are a masterstoke. All through the film there are scenes that are so perfect you want to see them again and again.By now, everyone must know the story and have heard the praises it has received. My comment is for any other older woman who want to see a really good Chow Yun-Fat film, to see this. He is great in it, and on top of that, Ti Lung is just so heart-breaking as his friend whose younger brother rejects him no matter what he does. Two fine performances. Try to find a version with sub-titles instead of dubbed voices. Much more satisfying.",
        "loc": "United States",
        "date": "2001-09-02"
    },
    "42": {
        "reliability": 0,
        "content": "John Woo started his career as a kung fu director,he then moved to comedy,where he also excelled, he was running out've gas when a well known producer Tsui Hark noticed his project \"Three Colors Of A Heroe\", Hark was intrigued,and agreed to produce it, gun fights weren't prevalent before this,because the HK audiences saw it as a skill that couldn't be improved,like martial arts or swords, John Woo showed them otherwise with this,Chow Yun Fat and Ti Lung really shine in this movie, before this,Chow, a tv actor was viewed as not cashable,and Ti, a washed up Wu Shu star,needed a new start,Leslie Cheung provided the confidence that theatre owners needed,after the movie broke all HK records in 86,all doubts were shredded,and John Woo and Chow Yun Fat were instant stars,Chow's infamous restaurant assassination scene, which was beautifully shot,is probobly the vision most ABT watchers remembered,after that,every young man in HK could be seen in a long coat and sunglasses like the ones Chow used,it also started the era of Heroic Bloodshed,that lasts even today,only John Woo could do it right, American directors tried to imitate it (Tarantino),but no one could do it like Woo.This movie spawned two sequels,and this was definitely the best,many consider \"The Killer\" John Woo's masterpiece,but this one was the original,the trendsetter,the best. Without this movie and Tsui Hark (God bless that man),John Woo would be nowhere (figuratively speaking), this movie is widely available in the US,so rent it or buy it (I personally like dubbing,but subtitles make it seem more poetic), 10 out've 10,beautiful movie",
        "loc": "Michigan",
        "date": "2001-07-24"
    },
    "43": {
        "reliability": 0,
        "content": "this could well be regarded as \"the godfather\" of hong kong cinema. chow yun fat's character, mark gau (which translates as \"brother mark\" in cantonese), is synonimous with the archtypal chinese gangster, so much so that it's common to find references to his character in later hong kong cinema and television. of all his gangster personas, it is this one that i relate most to his incarnation in the classic mobster tv series \"sheung hoi tan (shanghai beach)\" several years earlier.",
        "loc": "washington dc",
        "date": "2001-07-21"
    },
    "44": {
        "reliability": 0,
        "content": "\"A Better Tomorrow\" not only kick-started the careers of John Woo and Chow Yun-Fat, but ti also started the whole immensely popular heroic bloodshed genre. In my personal view, although Woo's work has often been emulated, both in the USA and in HK, it has never yet been bettered.\"A Better Tomorrow\" tells an age-old story, it is true: the story of two brothers, one of whom is a gangster, and the other of whom is a cop. But in this case, it's not the story that makes the movie great, but rather the way in which it is told. And it's told in an almost poetic manner, making full use of Woo's now trade-mark slo-mo and emotional punctuation throughout; rather than having a stiff, unnatural plot to adhere to, Woo seems to allow each individual character carve out the plot, which feels much less contrived. It is indeed Woo who makes the movie what it is; his trade-marks of love, brotherhood, honour, and betrayal are all here, and so are his camera trademarks, although they're not as refined as they will be later in \"The Killer\".Although he doesn't take the lead role in \"A Better Tomorrow\", Chow Yun-Fat does take all the limelight. He plays mobster Mark Gor, who steals every single scene he appears in, with his easy charisma and high morals. He forms the prototype for a character Woo will create many times again with Chow, most memorably in \"The Killer\".Essentially, it is action that propels \"A Better Tomorrow\" towards its inevitable climax, but is never violence without reason or style. And what style Woo injects it with. The most breathtaking instance of violence within the movie has got to be the notorious scene in which Mark Gor hides guns in flowerpots before blowing a whole roomfull of bad guys away. It is indescribeable; it will make the hairs stand up on the back of your neck, garaunteed.I give \"A Better Tomorrow\" 9 10, simply because I'm loathed to give any movie 10 10",
        "loc": "Norfolk, England",
        "date": "2001-02-24"
    },
    "45": {
        "reliability": 0,
        "content": "What can be better than a John Woo film with Chow Yun-Fat? Definitely need to add this to your library.John Woo does a superb job with the cinematography(as always). Only he can make somebody being beaten and shot to death be beautiful. Chow Yun-Fat was wonderful and absolutely adorable! The struggles of a man to forget his past and start over, brotherly love: The story is simply wonderful. I could watch this film over and over again.",
        "loc": "Atlanta, Georgia",
        "date": "2000-12-07"
    },
    "46": {
        "reliability": 0,
        "content": "This film is shorter than it should be to make it a true classic, but its long enough to showcase the acting talents and killing talents of Yun-Fat and Leung. It's a classic tale of betrayal, loyalty, ingratitude, death, love, and guns. If you love Chow's later films this is a must to see where he came from. Further, it'll leave you wondering just how exactly he acts in the sequel, and then in that's sequel...which is in fact a prequel...yeah. And by the way, Leung was in Hard Boiled with the CYF and John Woo.",
        "loc": "Eastern Film Society HQ",
        "date": "2000-12-05"
    },
    "47": {
        "reliability": 0,
        "content": "I know it doesn't really look that way right away, but trust me, this is a great movie that guy's will watch for the bloodshed but the gal's can still get a large emotional experience,i mean (i'm being VERY open here) I was crying at the end of this movie (yes i am a guy). Now this movie is considered to be the first (and to some the best) of famed director John Woo's heroic bloodshed style movies, now let me just inject this thought for a moment, any movie that has the name John Woo ANYWHERE involved in it is a good movie NO QUESTION. John Woo has this amazing ability to wow audiences with his spectacular ballet style shootouts (has to be seen to be believed) and his ability to make his storys refreshing and interesting, no reused storylines here. And this movie was the first. If you can get by the annoying dub acting you'll fing a great movie you're jaw will drop at the amazing action scenes, you'll laugh at the witty lines of Chow Yun Fat (Replacement Killers), and you'll cry at the saddening results of the tensions of a family divided by mob ties and cops. 6 out of 5 stars.",
        "loc": "Jersey",
        "date": "2000-09-18"
    },
    "48": {
        "reliability": 0,
        "content": "This was a great action film, despite its constant wallowing in melodrama and the age old story of good cop and criminal brother. The action is incredible, even the dubbing is okay, since the performances are uniformally great. Woo's only loser so far has been Hard Target. I give this gem an 8.",
        "loc": "Minot, ND, USA",
        "date": "2000-04-17"
    },
    "49": {
        "reliability": 0,
        "content": "This is truly the mother of all action films, not only for starting a whole new genre of gun-fighting action, but also because it has a great storyline told with an economical approach that will keep you glued to the screen until the very end.With \"A Better Tommorow\" in 1986, John Woo and the incredible Chow Yun-Fat established themselves as true geniuses. Most of John Woo's later films have more corny sentimental moments to them, but not this one. The editing are great, the action is totally heroic, and the actors performed flawlessly. I should also note that the acting in this film is definitely different from other John Woo films.Most people like \"The Killer\" or \"Hard-Boiled\" because it has more gun-fighting. But what makes \"A Better Tommorow\" more effective are its emotional pull and great acting, things that not many action films can boast about. Another great thing about this movie is that people will get to see how Chow Yun-Fat got his \"Coolest actor in the world\" name in the first place! At the end of the movie, all grown-up men will want to imitate Chow Yun-Fat. Those that became his trademark are the black trench-coat with a tie, shades, a toothpick, and twin handguns accompanied by an Uzi gun. I mean, Chow Yun-Fat is just so charming and cool!If you are looking for an action film with heart and class, go for gold. John Woo has truly made a masterpiece that started it all.",
        "loc": "New York, United States",
        "date": "2000-03-06"
    },
    "50": {
        "reliability": 0,
        "content": "This is the movie that started it all, the genre of \"heroic bloodshed\", and the careers of actor Chow Yun-Fat and director John Woo. gt;Chow Yun-Fat is just original as Mark Lee (better known to people as \"Mark-Gor\" Gor is brother ie. Brother Mark) After this film was released, there were many fans who donned trench-coats and chewed match sticks, because they wanted to be like Mark. CYF is just so cool!The gunfight scenes are just AWESOME. Shing (Waise Lee) is just a brilliant bad guy.A classic John Woo masterpiece. An original piece of work and acting on CYF's part. 'nuff said. 10 10!",
        "loc": "Australia",
        "date": "1999-12-17"
    },
    "51": {
        "reliability": 0,
        "content": "You probably know the story from the other comments, concerning a rift between brothers and a disgraced gunman. This movie is one of the best of all time, and I never understand it's so-so to pretty good ratings. It's a definite GREAT movie, not a pretty good one. Everything in it is perfect, except perhaps the end where in some parts you could tell they were on a somewhat limited budget. The gunfights are excellent, even if short, and Chow Yun-Fat acts in this one better than any other actor in any part.",
        "loc": "USA",
        "date": "1999-09-29"
    },
    "52": {
        "reliability": 0,
        "content": "A Better Tomorrow is a film best watched with some level of familiarity of the John Woo films that followed it. This forceful melodrama is largely responsible for the direction Hong Kong cinema took in the years up to the 1997 handover. The story is largely familiar to Woo fans and concerns many emotional elements like friendship, honor and forgiveness. All of these elements come to a head in the form of violence. The gun battles are not as ferocious as those in Woo's later pictures, but they manage to illustrate many emotions on screen that had not been seen in any similar action picture to that date, save for some from Sam Peckinpah's prime, like the Wild Bunch. As in all of Woo's gangster films, the villain is a pure figure of evil and the heroes, despite being morally questionable, are very righteous. Chow Yun-Fat's now legendary performance is the real clincher here, but the whole cast is good. Some of the makeshift dramatics are obvious and slightly hinder the film from being taken seriously at times, but given this was a change of direction for Woo, this is understandable. The climactic shootout is awe-inspiring, and it leads to an even more emotional showdown between the protagonists and the crime boss.Overall, this picture succeeds using the same core elements that would later make John Woo's work so fabled.",
        "loc": null,
        "date": "1999-06-01"
    },
    "53": {
        "reliability": 0,
        "content": "A Better Tomorrow is one of the most original, heroic movies of Asian cinema history. The movie started the cult-favorite genre of \"heroic bloodshed\" as they call it. It's no surprise that John Woo made another great movie here, but the drama mixed in with the usual Woo-type gunfighting was surprising. When I rented the film I expected a great action flick with my favorite actor and director teaming up. It's really a clever little movie with lots of emotion which all clashes in the heroic, bloody, tearjerking finale. The action is not as good as the classic melodrama The Killer or that underdog masterpiece of an action film they call Hard-Boiled, but the Deer Hunter -type drama that grips you and holds you still till the very end is really good.Anyone who liked Face Off or Hard-Boiled might enjoy this for its original action, but The Killer, The Godfather and Scarface-type fans will love it.",
        "loc": "New Zealand",
        "date": "1998-08-31"
    },
    "54": {
        "reliability": 0.5,
        "content": "Made before the Asian film wave of the late 90s and often inexplicably neglected in John Woo retrospectives, with the unfortunate result of being rather unknown to many cinephiles worldwide, 'A Better Tomorrow' and its sequel nevertheless became arguably the first real example of a pop culture phenomenon that seized the imagination of the entire Far Eastern region and helped create a craze for Hong Kong films that lasted a decade (go into any street in Seoul or Tokyo and hum Leslie Cheung's theme song, and chances are there will be at least some who will still recognize it). It is difficult to describe now just what a zeitgeist-making movie this really was: it catapulted not only the director Woo and the leading man Chow to superstardom, but helped put Leslie Cheung over the top in the film business with a hitherto rare serious role and that song.As a concentrated concoction of melodramatic violence, it doesn't quite measure up to 'The Killer', and lacks the balletic geometry of 'Hard Boiled', but the doomed camaraderie of Chow and his crew, reminiscent of the classic westerns or perhaps 'Seven Samurai', and the surprisingly sensitive treatment of wounded machismo, set 'Tomorrow' apart from subsequent Hong Kong actioners. Chow looks so effortlessly cool that it is with aching regret that you watch his Hollywood disasters (Tinseltown tended to treat his character as a sort of Freeman-lite sage, prot g in tow, whereas Chow was always at his best as a quietly smouldering loner); Cheung, already a star, became a legitimate Asian icon; and Woo, for whom 'Tomorrow' was the first real success and would incontestably go on to make more complete movies, hasn't quite yet managed to dress so well the sorrow of men's failed dreams with such stylish violence again.It is remarkable to compare Hong Kong's approach to destructive masculinity in action movies with the contemporary sturm-und-drang of Schwarzenegger-era Hollywood: while the latter concentrated on biceps the size of the Alps and explosions of increasingly tectonic severity, Woo helped create a seminal style of graceful, tightly defined slow-mo set-pieces and a narrative, though simple, that was always grounded in identifiable human emotions. At least some of these elements would famously go on to influence turn-of-century Hollywood, but this is where it all started - the original and still definitive John Woo Chow Yun-Fat collaboration, and the quintessential 80s Asian movie experience.",
        "loc": "South Korea",
        "date": "2009-09-06"
    },
    "55": {
        "reliability": 0.5,
        "content": "You like action you like guns and if you like woo you will love this movie.The action scenes are a success the storie is fun and the plot is good. The two only things laking in this movie are the characters and the music (which you have a soap TV fealing)but for the rest i am stunt. I must say one thing that i was amazed by the character of mark(Yun-Fat Chow)in this film.This is the movie the started the styles of john woo and this is the movie that started the career of chow yun fat. So if you want to have fun buy this movie and enjoy the action and the drama of it",
        "loc": "Canada",
        "date": "2007-09-01"
    },
    "56": {
        "reliability": 0.5,
        "content": "It took Quentin Tarantino's seal of approval to make Hong Kongmovies hip to Western audiences, but Tarantino's protection stillcan't disguise the many faults in John Woo's Z-grade thriller. Theschlocky, corny script could only have come from an Oriental ideaof an American movie, the music score is atrociously obtrusiveand both Leslie Cheung and Emily Chu overact hideously. But forall that there's real energy in Woo's handling of the material: hedeftly side-steps the corn element to get the story chugging alongeffortlessly, then concentrates on the virtuoso action scenes whichbenefit from the tight editing and elaborate production lacking fromthe rest of the film. That Woo is a master at filming action waslargely proven in his later Hollywood films, notably \"Broken Arrow\";working with only a fraction of the budget, the results are lessimpressive but equally arresting. However, you should definitelyavoid the English-dubbed version, which is not only appallinglydubbed but also cuts five minutes from the Cantonese-spokenoriginal.",
        "loc": "Lisbon",
        "date": "2003-11-25"
    },
    "57": {
        "reliability": 0.5,
        "content": "A Better Tomorrow is John Woo's first film. Like most of Woo's films - A Better Tomorrow has a \"soap opera\" like quality plot, but brilliant action. The story basically focuses on two brothers - one a gangster, the other a rising cop. The gangster brother tries to go straight (feeling guilty about his life in context to his brothers) - but the cop brother blames the gangster for the death of a relative. I actually found the plot to be very engaging (despite the very dodgy subtitles on my copy of the movie) and thrilling. As Ti-Luing (the gangster) and Mark (a friend) spiral downwards into a blood-soaked finale. Chow Lun-Fat is a stand out as the flamboyant but tragic Mark. The movie has moments of stylish action (a trademark of Woo) - but his best was definitely yet to come (see Hard Boiled or the Killer). But in terms of engagement - A Better Tomorrow packs a punch.",
        "loc": "Australia",
        "date": "2004-11-11"
    },
    "58": {
        "reliability": 0.0,
        "content": "I am a fan of Asian cinema. I have probably seen more Chinese, Korean, and Japanese films than anyone you know. I like Asian cinema because it is different- some things can be gotten away with in Asian cinema that cannot be gotten away with in Western Eurpopean cinema- it is probably due to the language barrier that I can see many scenes in Asian cinema that don't bother me- but WOULD if it were done with English actors in the English language. I am straying from the topic, but it's important to preface this with the fact that I have seen more Asian gangster films than I have Western ones.The fact is: I wanted to like this movie but cannot and will not. It is a very poorly done movie. The action is over the top and unrealistic- like video game type violence- which is common in Chinese movies- and the story is simple- too simple- its like a children's story for adults- what I mean by that is- the language used is very simple. It's like ABC type stuff- elementary- nothing about the script is challenging for a writer to come up with. It's simply a revenge tale with a love hate triangle. A brother loves his brother and his brother hates him and that brothers girlfriend wants to see them reunite- and so does a friend of the older brother- but the two brothers are opposites and this creates 1 2 of the drama- the other 1 2 being that the mob is after both of them and they have to survive while fighting each other which makes it harder to. The main characters have infinite ammo- in the whole movie I have seen the main character reload his gun maybe only once- in this movie barrels explode unlike in real life- and in this movie we see a cripple who normally walks with a limp- RUN like an athlete when he is being shot at and trying to avoid the bullets- but it's not done for comedic effect- simply done based on negligence of the director choreographer who didn't notice this mistake or did not care. Worst of all about this movie is that I found it boring! Not only am i criticizing the action of it (which was fairly good but too over the top fake for me) but the pace is very slow and the acting is great, but the lines and story are not so it hardly matters to me. I have a bone to pick with most if not all Asian action movies that come to mind- gangster films or not there is always something that by the end makes me not want to watch it again or recommend it to anyone.....I say this because I would love to recommend a movie to watch in place of this but cannot think of a solid recommendation to act as a substitute. Watch this if your time means nothing to you and you would gladly waste it. Or if your time does mean something to you- watch the actions scenes of this movie alone on youtube- and perhaps play a first person shooter video game online- would be more fun than sitting through this boring movie.",
        "loc": "United States",
        "date": "2015-05-16"
    },
    "59": {
        "reliability": 0.0,
        "content": "Perhaps the most influential director the action genre will ever see, John Woo honed his craft at the legendary Shaw Brothers studio before joining with producer Tsui Hark and finding his true calling in the crime genre. Woo's signature style, consisting of balletic action sequences alongside themes of religion, family and, of course, doves, is established with A Better Tomorrow. The Matrix, Reservoir Dogs, Pulp Fiction, True Romance, Desperado, in fact, any film with a standoff, a dove, some slow motion or a black suited criminal owes a great debt to a signature style that was established with this film. John Woo has made better films, and he has made films that are much, much worse, but he will never come close to making the impact he did with this, his first slice of heroic bloodshed. KT",
        "loc": "www",
        "date": "2010-08-13"
    },
    "60": {
        "reliability": 0.0,
        "content": "Since Bruce Lee reinvented Hong Kong and material arts cinema Hong Kong's film industry became one of the biggest in the world. Hong Kong cinema became well known for doing through different phases, from Jackie Chan comedy action, John Woo's heroic bloodshed films, historical material arts films and Hollywood influenced films like the Infernal Affairs series.In the mid-eighties John Woo, one of the most popular action directors in the world, reinvented Hong Kong cinema with producer Tsui Hark to create the heroic bloodshed genre, bloody action films set in the world of organised crime. A Better Tomorrow is the first of it kind, and became a popular in film in both Hong Kong and internationally.A Better Tomorrow tells the story of Sung Tse-Ho (Ti Lung), a captain within the Triads and running a successful counterfeiting operation. He is aided by his loyal lieutenant and best friend Mark (Chow Yun-Fat), he is handy with guns. Ho's younger brother Kit (Leslie Cheung) is training to be a police officer, and the two love each other every much. They both help take care of their sick father. But Ho's life of crime is destroyed when he gets arrested in Taiwan. His father is murdered in front of Kit, and when Mark gets revenge he is crippled. Three years later Ho tries to go straight, getting a job as a taxi driver. But his younger brother, now a rising cop hates him and Mark is a low ranking Triad member, forced to work for Shing (Waise Lee), Ho's replacement. Shing asks Ho to rejoin the Triads, and run the counterfeiting operation. When Ho refuses Shing threatens Kit and Mark, forcing Ho to take action to safeguard his loved ones.The mid-eighties and early nineties was when John Woo was at his creative powers, making very well known films and ended up getting calls from Hollywood. He because a director respected by his peers like Martin Scorsese and Quentin Tarrantino. A Better Tomorrow shows Woo's skill. He crafts out some every exciting, through, bloody action scenes. There are well managed gun and fist fights, and this should be shown to editors in Hollywood to show how to cut and action sequence. Woo also knows when to slow things down to allow the plot and characters to develop. The plot is a simple affair, it's an action film with gangsters, not a gangster film. But the plot is done well enough to keep you interested, and character are developed to give the story drive. Ho is an decent man who wants to pay for his crimes and forced back into action, whilst Kit starts off as a clumpy kid who turns into overzealist cop.A Better Tomorrow does start with some physical humour, but that quickly dies down and the film takes a more serious tone. It was also refreshing for me to see a John Woo film without his usual trademarks, the only one is a character using two guns.The acting is decent, Ti Lung was good lead, and Leslie Cheung was showed some range in his supporting role. This was Chow Yun-Fat's first major role and obvious this leads to bigger things for him. He too show's his skills as an actor. Waise Lee was also perfectly sinister as the villain of the piece.However, when the film does show English speaking characters, the dubbing makes them sound so fake, especially compared to the Cantonese characters.A very entertaining film and a must see for action fans. 8.3 out of 10.",
        "loc": "United Kingdom",
        "date": "2010-02-01"
    },
    "61": {
        "reliability": 0.0,
        "content": "CONTAINS SERIOUS SPOILERS!!!From the opening credits to the final moments, A Better Tomorrow is blinding, with it's brilliant merge of Emotional Drama to Balls-out shoot out movie this is pure genius all the way, Chow's character larns not to fight the hard way in the end. Fantastically choreographed acting, a very rare thing, a true masterpiece, pure genius, the best film ever!!!",
        "loc": "The North West of England",
        "date": "2004-01-14"
    },
    "62": {
        "reliability": 0.0,
        "content": "I fell in love with this movie with the first viewing. What's so cool about this movie is the struggles between the brothers and the themes of redemption and loyalty. Marvelous acting done by the lead characters. They really come to life, especially Mark Gor. Although the theme song can get a bit repetitive, it's very suiting for the movie.Do yourself a favor and pick up a copy of this. 9 10",
        "loc": "NY",
        "date": "2003-09-16"
    },
    "63": {
        "reliability": 0.0,
        "content": "This is the first John Woo film that I saw. Needless to say, after I saw this I was hooked on Hong Kong action flicks. Chow Yun-Fat looks cool and gets to show his acting range. Ti Lung gives his usual solid performance. Leslie Cheung shows us why he became a huge star after this film. You can probably rent this flick at your local video store for the change in your pocket, so give it a try. 8 10",
        "loc": "Schenectady, NY",
        "date": "2003-08-16"
    },
    "64": {
        "reliability": 0.0,
        "content": "Without this great film, John Woo would not have the stamina to continue on his career. Obviously his first gunplay movie, Heroes Shed No Tears, did not receive him the fame ABT provided, so his second attempt was the success he needed. Looking realistically, some of the events seem unrealistic (only 4 years in prison for murder?), but then again, I don't live in Hong Kong or Taiwan, so I lack that vital information. Regardless, one could not document the life of Woo without considering this great action flick. Thus begins the age of dual pistols!",
        "loc": "Memphis",
        "date": "2003-06-30"
    },
    "65": {
        "reliability": 0.0,
        "content": "I saw this film while in college, and though I saw The Killer first, this film is just as powerful and they both stand together as films that have totally reshaped my concept of what an action movie is. Also, as I become more aware of what makes a movie work, I pick up on the depth of the characters, what drives them to their destinies and the relationships that are forged or destroyed along the way. All in all a wonderful film, but I must admit it is the action scenes within Woo's Hong Kong films that keep me in constant awe, no matter how many times I watch them. Perhaps it was a conscious decision to move away from such scenes in his films, but nevertheless John Woo has left us a handful of films that can stand on their own as some of the greatest movies of all time.",
        "loc": "Norfolk, VA",
        "date": "2003-01-21"
    },
    "66": {
        "reliability": 0.0,
        "content": "A BETTER TOMORROW YING HUANG BOON SIK is a actionmovie like no other.I have always admired John Woo for his efforts in the genre. The quick editing, smooth actionsequences, brilliant using of slow motion and at some points very impressing effects (e.g the mirror in FACE OFF). This movie, his international breakthrough and Hong Kong-hit, is all the usual elements from a Woo-film. A gripping side-story. This time the brotherhood wich get more complicated all the time, until the final sequence where one of them make a move that is about to change both of their lives forever. At that point I got moved, and moved by an actionmovie that's new. Another element is the fantastic action-directing. One of the first action-scenes in the movie is where Ho walks in to the conferance-table and start to shoot with two guns hidden in a couple of pots. You are in trans, from the weird music and the unconnected events that appears, when suddenly they fit up and the music stops... It is simply very good.But it feels like something is missing. I can't figure it out but the rating is 7.5 10",
        "loc": "Sweden",
        "date": "2000-06-14"
    },
    "67": {
        "reliability": 0.0,
        "content": "After viewing many Hong Kong movies as a child, I lost touch with this medium and for a long period did not even bother to think of it. A Better Tomorrow on DVD brought me back. While visiting a DVD shop I stumbled across an old Chow Yun Fat movie (I forgot the title), and asked whether it was worth a purchase. The salesperson told me I would be happier with another Fat movie and handed me \"A Better Tomorrow\" DVD from Media Asia (original soundtrack). Well, why not? So I bought the disc and went home. Wow. Halfway though the movie, all I could think about was whether the store had the sequels in stock or not. This movie is awesome. No, it's not the action type of film you may expect when hearing the name \"John Woo\". It's no Con Air or Hard Boiled in terms of nonstop explosions and fighting. There isn't even as much action as is in \"Broken Arrow\". When the movie starts and for a good portion of the movie it's all talk. But it's not boring. You are drawn in by the themes of brotherhood and betrayal. Who are the bad guys? The overall premise is about two brothers, Ho and Kit, one of which is a criminal and the other a cop. Can they coexist? Will there be forgiveness? Chow Yun Fat gives a stunning performance as Ho's friend Mark. I recommend this movie to anyone who is a fan of John Woo. Go and see how it all began.",
        "loc": "USA",
        "date": "2000-04-10"
    },
    "68": {
        "reliability": 0.0,
        "content": "Besides \"The Killer\" this is my favorite Chow Yun Fat John Woo movie. It's all here: gunfights like ballet, drama,chow yun fat with 2 guns blazing. Even the dubbing wasn't that bad. A great movie.",
        "loc": "ohio",
        "date": "1999-08-23"
    },
    "69": {
        "reliability": 0.0,
        "content": "I saw this film after watching \"The Killer\" and \"Hard Boiled\" two other John Woo films that I think are better. Not that this is bad..I give it a 7 out of 10. But there were some parts that were kind of corny that brought it down somewhat, and unfortunately the dubbing was awful in the version I saw, although that doesn't influence my vote at all. It has several decent gunfights, but after seen the gunfights of his later films, this really didn't impress me much, perhaps if I had seen this one first....The story is very good as well, but once again not as good as \"The Killer\". But if you are a John Woo fan, then this is a must.",
        "loc": "pennsylvania",
        "date": "1999-02-22"
    },
    "70": {
        "reliability": 0.0,
        "content": "I didn't like A Better Tomorrow as much as other John Woo Chow Yun-Fat movies like The Killer and Hard Boiled but it was still very entertaining. The action was impressive and the story was good too. The dubbing was terrible though.",
        "loc": "South Carolina",
        "date": "1999-01-24"
    },
    "71": {
        "reliability": 0.0,
        "content": "John Woo's finest moment - a spellbinding story with powerful acting deliveries (with Chow Yun Fat or \"Choo-yun-baa\" as known in korea in the lead role). The action is rivetting, I found myself on the edge of my seat throughout this movie. One movie worth buying!Please make sure that you watch the SUBTITLED version and not the dubbed version. Whenever they dub foreign movies, it's as if they deliberately pick the least suited voice for the characters (and then proceed to record the dialogue using a tin can)",
        "loc": "Rugby, England",
        "date": "1999-01-01"
    },
    "72": {
        "reliability": 0.33,
        "content": "John Woo was making films for a full 20 years before he decided on a plot device that he has revisited again and again over the more successful phase of his career as an \"action first plot second\" writer-director.That wrinkle was to have a good guy and a bad guy exist alongside one another, and indeed even team up at times, so that the audience could see that they might not really be that different, and to lead to several stand-offs and situations where they are in close proximity.The first notable time that occurred was in this film made in 1986, but of course Woo went back to the well with The Killer, Hardboiled and Face Off, among others.This film also showed that Chow Yun Fat is a cool cat regardless whether he is playing a good or a bad guy. (His presence alone made me watch Bulletproof Monk not once, but TWICE.) In A Better Tomorrow, Yun-Fat is Mark, a small time gangster of little significance who piggybacks the success of Ho Sung, both are intimately involved in an operation counterfeiting US currency.(Mark is cool because he wears sunnies inside and he always has a toothpick hanging out the side of his mouth, even while he is smoking.) Ho Sung's little bro Kit is graduating from the Police Training Academy and entering the force, and their Dad's dying wish is that Ho Sung go straight and not allow Kit to find out what a bad guy he really is.Ho-Sung agrees, after one last job Of course the \"one last job\" goes bad, and Ho Sung ends up in prison after his young new prot g Shing sells him out to the cops. After finding out that Ho is in da' joint Mark puts a hit on the bad guys, and is he himself shot in the leg. ( I might add here that even if it wasn't the first time he did it, Woo was already a fan of allowing his characters to shoot 77 rounds from a pistol without reloading.) Fast forward 3 years gt; gt; gt; gt; gt; Ho is out of prison and Kit is now a senior cop. Having copped a little grief from his peers and superiors at having a crim for a brother Kit wants nothing to do with Ho, who only wants to prove that he is true to his word and is in fact going straight.Ho gets a job and does go straight, and when he comes across Mark he is saddened that he is now nothing more than a limping dogsbody for his new gang-boss Shing, the very guy who sold Ho out just 3 years prior.That is a lot of stuff, apparently 3 years is a very long time in Hong Kong.From this point the film becomes a tug of war: Ho wants nothing more than to show Kit he's a good boy now, Shing wants Ho back in the business, as does Mark who will not be allowed in without him, and Kit just wants to bust the whole lot of them to prove he is a supercop with no family bias.Given all that, it's hard to see this ending happily.The usual Woo signature flashes are present, the slo-mo violence, the generous and effective use of blood-packs and squibs to show the spurts created by some of the 77 rounds fired from each magazine, and in the Big Shootout at the end of the film Mark gets to use two pistols at once, something that he then did in every film he ended up doing with Woo.A Better Tomorrow doesn't hold up well unfortunately despite being seen as a genre-setting film at the time, and being namechecked by everyone and his Tarantino as being influential. It is momentously cheesy at times (see below), has some obviously clumsy direction as Woo worked on his chops and just a terrible soundtrack, somehow though it manages to be a passable flick if nothing better is available. The problem is that nowadays there should always be something better available, namely almost everything that Woo did after this, for example.Final Rating 6 10. A Better Tomorrow showed signs of what was to come without ever making me Woo-zy, and it never really reaches any heights.If you liked this review (or even if you didn't) check out oneguyrambling.com",
        "loc": "Australia",
        "date": "2010-11-14"
    },
    "73": {
        "reliability": 0.33,
        "content": "John Woo's \"A Better Tomorrow\" is one of my favourite films, while it may not be the best example to illustrate his action artistry it illustrates his skill as a filmmaker and storyteller perfectly. The story itself is a classic emotional tale of gangster redemption: Mark and Ho are partners in crime, gangster bosses and best friends. Life is great (Ho even managing to conceal his profession from his cop brother Kit) until one day a job goes foul, Ho is banged up in prison and Mark gets crippled trying to avenge him. One prison montage later and Ho is released to find his father topped by rival gangsters, his brother hates his guts, and his best friend Mark is working for peanuts downtrodden by the same gang he was once a boss of. Now the two of them must get out and play it straight, but will the gang let them go and will Kit ever forgive Ho? Oh yes, what a great set up and it delivers, as what follows is one of the greatest tales of gangster redemption to hit the big screen. At times (and coupled with the now dated, melodramatic soundtrack) it borders on cheesy, but the best possible kind of cheesy, the kind of cheesy that made fans chant \"ROCKY! ROCKY!\" at the first screenings of \"Rocky Balboa\" in London. Performances are strong all round but Chow Yun Fat outshines his competition, proving he is a fantastic actor, with an amazing and powerful performance (something he isn't often given the chance to do in his frequently typecast Hollywood outings).Most importantly for a story like this the action is top notch, while, as I said, Woo has since outshined the film in terms of action \"A Better Tomorrow\" still delivers some exciting and memorable action scenes (see the revenge scene, supposedly a very famous sequence in the world of action choreography, and the final shoot out). It's fast, blood and bullets fly, stuff blows up everything does as it should and more. In conclusion, if you are looking for Woo's best action film you might be better off with \"Hard Boiled\" or \"The Killer\", but if you are looking for his best film give \"A Better Tomorrow\" a try.",
        "loc": "United Kingdom",
        "date": "2007-07-19"
    },
    "74": {
        "reliability": 0.33,
        "content": "\"A better tomorrow\" is filmed in 1986, directed by John Woo, acted by Chow Yun Fat, Ti Lung and Leslie Cheung. The story is about friendship and brotherhood. Ti is a triad boss, he runs his counterfeit money business with his best friend Chow, however, his brother Cheung is a police. After the death of Ti and Cheungs' father, the conflict between them becomes harder.unfortunately, Ti and Chow are betrayed by their subordinate,LEE.Afterward, Ti is sent to jail, and Chow becomes lame. 3 years later,Ti got released,he decides to improve the relationship between Cheung, so he quits the triad, want to be a good man,but Cheung seems doesn't forgive him. Moreover, Chow is waiting for a opportunity to revenge. Lee, who is the new boss of the triad, he forces Ti to co-operate the criminal act,but Ti refuses to do so. During a investigation, Cheung is shot by Lee, this makes Ti understand that he must strike back. Ti,Chow and Cheung decide to spend their rest lives with bullets......I think \"a better tomorrow\" is the best film of John Woo ever. the description of their brotherhood is very true, and the gun-shoot scenes are brilliant, even better than nowadays'. The Film won best actor (Chow Yun Fat) and best picture (a better tomorrow) and 9 nominations in Hong Kong film awards in 1987. It also becomes the top-grossing film in Hong Kong for several years.I love this movie very much because Chow Yun Fat is cool in this movie. His long coat,sun-glasses and are the icons of 80'S. By the way, their is a classic scene at the end of the movie, he is shot by 4X bullets and died which is inspired by Bonnie amp; Clyde in 1967.",
        "loc": "Hong Kong",
        "date": "2007-06-11"
    },
    "75": {
        "reliability": 0.33,
        "content": "John Woo is undoubtedly one of the most famous modern action directors. With his impressive stylishly directed action scenes and an unnatural for a action movie focus on drama and friendship he carved his way in to the top. And this, this where it all began. This is the one movie that started the trench-coat, sun glasses fad, that we've seen so often imitated. This is the movie that propelled both Woo's and Chow Yun Fat's carriers. This is the movie that put the gangster crime flick on the map in Hong Kong. And quite honestly it is worth all the praise it had received. A Better Tomorrow is a story about the moral dilemma of an ex gangster whose recent release from prison has put him on a crossroad between his cop brother friend and his former friend and partner in crime.Few movies try to blend action and drama and even fewer succeed. Here Woo demonstrates his ability not only as a capable action director but also as a person who understands human emotion and knows how to put it on screen.The action scenes themselves are stylishly directed, with Woo demonstrating what would later become his trademark style. It is easy to see the influence Sam Pickenpah's movie have had over him. Using a combination of slow motion with a heavy dose of destruction and choreography he creates a beautiful emotionally driven picture of mayhem and death. But does not over-use it mind you. The scenes are well placed and balanced throughout the movie, never making the viewer feel tired of them. The acting from all sides is top notch with Chow Yun Fat making a great impression with his character Mark Gor. With the story evolving we see the characters evolving along with it adding great depth and also a better understanding of their own personal motivation. It is amazing to see how successfully the actors adapted to that change in character.There never is a boring moment. With Woo keeping the plot's progression straight forward. There is no happy ending here though if there had been it would have ruined much of the build up during film and would have ended up feeling as any other typical film of the genre. No. Instead Woo relies heavily on the build up of tension between the main characters during the film to execute and create a much more emotional and sad conclusion to this violent epic. After it's release nearly 20 years ago there have been dozens even hundreds of attempts to recreate John Woo's specific style. And while some of them might have even come close they all still make the same error, thinking it's only the action that drives the film. While in fact it is the likable and strongly developed characters that give a whole new reason for the action scenes. Not only entertaining us but also making us care.",
        "loc": "Bulgaria",
        "date": "2007-01-12"
    },
    "76": {
        "reliability": 0.33,
        "content": "I saw this movie 2 months ago,after \"The Killer\",which i considered the best John woo'action flick...Until \"A Better Tomorrow\" came in my way! This is (for me) the perfect sum of the \"Heroic Bloodshed\" genre:strong characters,drama and great action.The actors play very well their stereotyped but at the same time full-fleshed roles...And,oh man,Chow yun Fat is probably the ultimate bad ass,too bad his character died in that way (killed by the main villain in probably the most vile way a man can kill another man...),even if the final gunfight is totally awesome! Speaking about the other two main characters (aka \"the two brothers\") all i have to say is that they try from the beginning till the end to gain the sympathy from the audience...And they completely hit the target:i cared for Leslie Cheung and Lung Ti,and at the end i was very happy that they both survived (well...until \"A Better Tomorrow 2\")! So,what i've to say to close my first comment on IMDb? If you enjoyed the movie as i did,i hope you have understood why i love this movie,and if you haven't seen yet...What are you waiting for? Go and get this pure gem of vengeance,pain,deliverance and friendship,straight from Hong Kong!!!!",
        "loc": "Italy",
        "date": "2007-01-02"
    },
    "77": {
        "reliability": 0.33,
        "content": "A brilliant movie about brotherhood, honor, pride and acceptance. Chow Yun Fat's role as the Hong Kong gangsta Mark Gor was very well played (with the classic sunglasses on and chewing a matchstick in his mouth, very effective in portraying the character of Mark Gor). I can now see why Chow Yun Fat went on to make other great gangsta movies, he's got that classic wise guy look that just naturally comes to him. John Woo also did a great job in the gun fight scenes, although some of the special effects were pretty crude compared to today's. This is not a very violent movie if u compare it to today's films such as the Texas Chainsaw Massacre, so it is very suitable for audiences of all ages. Overall, still a great movie with great story telling even though it's 20 years old.",
        "loc": null,
        "date": "2006-01-06"
    },
    "78": {
        "reliability": 0.33,
        "content": "A Better Tomorrow is a well-known movie by many fans of cinema and it's not difficult to tell why.ABT indeed is a splendid example about how to make an extremely touching and deep movie with simple plot and great actors.Chow Yun Fat is (once again) great, his character embody the will to revenge of a man who lost wealth and money to regain honour as his partner Lung Ti.The character played by Leslie Cheung is a true gem, a policeman who has to choose between the love of a brother and justice. Not a very simple one..John Woo has the merit to have installed one of the most epic trilogy ever without futile bombastic-poor-drama sequences to set up an unforgettable ballet of bullets and honour.",
        "loc": "Italy",
        "date": "2005-03-07"
    },
    "79": {
        "reliability": 0.43,
        "content": "Even for a Hong Kong movie, this is a very violent film. If you've seen a Hong Kong Kung Fu movie that is like one fight scene after another, this movie is like those fight scenes replaced by shooting matches. Granted that this was the movie that made Chow Yun Fat a big star and he looks great in his black raincoat. Despite the title \"Better tomorrow\" I don't see this happening to anyone but Kit ( Leslie Chueng ) and his brother because other people are all dead. Another viewer did a very good job of describing the story line, and there is not much to add to that. If you like action, then you'll probably like this movie but it was little too much for this viewer's taste.",
        "loc": "United States",
        "date": "2005-03-22"
    },
    "80": {
        "reliability": 0.45,
        "content": "It's one of John Woo's earlier efforts, and it's pretty clear that he hadn't perfected his cinematic techniques yet; his work here is alternately stylized and just plain crude. The story isn't very interesting; the score often gets melodramatic and pushy; and the appallingly bad dubbing job (if you're unlucky enough to find yourself watching a dubbed version) renders the movie nearly unwatchable. I'd say skip it altogether and go watch \"The Killer\", which is LIGHT YEARS AHEAD of this, IF it weren't for Chow Yun Fat's astonishing, moving performance. You do need to see this movie after all...if only to realize how much more than simply an \"action star\" he really is. ( )",
        "loc": null,
        "date": "2003-11-01"
    },
    "81": {
        "reliability": 0.0,
        "content": "Its odd how some gangster films from the 1970s and 1980s have dated more than those made in the 1930s and 1940s, probably because the pacing and the snappy dialog crammed into 80 minutes wears much better than long stretches of attitude and out-of-date clothes and second- rate music.The main reason folks seem to watch John Woo is for his grasp of kinetic gun play and maximum explosive violence, and that said, he does it infinitely better in his later films, mainly Hard Boiled, in which the last 30 minutes is absolute dynamite. There are a few scenes in A Better Tomorrow worth wading through in this film, and Chow Yun-Fat is persuasive as a silent gun man with a strong personal code, but you just want to smack the kid brother, whose petulance and whining grows tiresome after about ten minutes, and the final shootout, even though dozens of whirling bodies go flying through the air, is fairly predictable to seasoned viewers. This is a good film to watch to see where Woo was grounded, but I think his mature work shines in comparison",
        "loc": "Paradise, California",
        "date": "2013-04-24"
    },
    "82": {
        "reliability": 0.0,
        "content": "John Woo, at his peak, manages to eliminate so-called \"action directors\" of Hollywood who favor blowing everything up over real drama. John Woo is unique, but not unlike anyone else. It's just that he's so damn good at what he does. He creates action in a way no-one else can, and even reinvented the \"bullet-ballet\" action sub-genre. Yet his films still contain emotionally deep characters, powerful dialog, strong poetic imagery and exceptional drama. \"The Killer\" is a great example of the charismatic work of John Woo, but \"A Better Tomorrow\" is perfect.Torn between the Triad lifestyle and loyalty to his graduating police officer brother, Kit (Leslie Cheung), Ho (Ti Lung) eventually forces himself to leave his life of crime when he surrenders himself to police after a double-crossed money exchange. Mark (Chow-Yun Fat) is a top-class player in Ho's business but is reduced to the status of washing the boss's car when Ho goes to prison. Still unforgiven by Kit, who is now a growing figure within the Hong Kong Police, and now released from prison, Ho is pressured towards rejoining the Triads in exchange for Mark's reinstatement and his surveying brother's life.The film includes incredibly choreographed and directed action sequences, as would be expected of any Woo film. The character relations and interactions are genuinely moving and emphasize the friendship and mutual respect these men hold for each other. The entire cast is flawless, right down to the support players, including Kenneth Tsang, who all deliver performances of genuine solidarity and power. So see this John Woo classic now, and watch out for his minor role as the Police chief, not a bad actor either...",
        "loc": null,
        "date": "2005-04-19"
    },
    "83": {
        "reliability": 0.0,
        "content": "This movie has everything within a John Woo movie from the big action ending scene to the main protagonists having to decide what road in life they would like to travel down. I have to say that the plot surrounding the two brothers and Chow Yun Fat are very touching and heart-warming. Obviously with every Asian action film there are moments where it seems quite impossible and unreal, but watcha gonna do?........If you like Hong Kong action films like myself, you'll enjoy this flick....8 10",
        "loc": "Mississauga, Ontario",
        "date": "2003-01-24"
    },
    "84": {
        "reliability": 0.25,
        "content": "This is a John Woo masterpiece!, with some incredible exciting shootouts!,an awesome story and amazing performances. All the characters are wonderful, and it really has a great gritty feel to it!, plus Yun-Fat Chow is simply amazing in this!. The action is simply incredible, and the character development it top notch!, plus all the characters are very likable!. It has lots of great emotional moments, and the finale is absolutely crazy and shocking!, plus i was really surprised by how moving the story was. I also loved how they all bonded together at the end and took action, and i thought Waise Lee was fantastic as the main villain and very sadistic, plus it's very well written by Hark Tsui and made as well!. The opening is really cool, and i thought Yun-Fat Chow was a major bad ass!, plus The ending was great and very emotional!. They don't make then like this anymore!, this is a John Woo masterpiece, with some incredible exciting shootouts an awesome story, and amazing performances, and i say Go see it now!. The Direction is wonderful!. John Woo does a wonderful job here, with outstanding camera work, great angles, it's very stylish, and he kept the film at a very fast pace!. This movie is extremely violent!. We get hundreds of extremely bloody gunshot wounds, blood all over the place, gunshot wounds to the head, harsh bloody beatings, stabbings, impaling's, and more!. The Acting is fantastic!.Yun-Fat Chow is AMAZING as always, and is amazing here, he is extremely likable, a major bad ass, is fantastic in the acting department, delivered a great speech near the end, had loads of charisma, kicked that ass, and i just loved him overall! (Chow Rules!!). Lung Ti is wonderful here, he was also extremely likable, the main character in this film, had good chemistry with Yun and Leslie Cheung, and was just very believable!. Leslie Cheung is wonderful here as Kit, he was extremely likable, and i really felt for his character, he was especially good at the end!. Waise Lee is fantastic as the main villain, he was cold, ruthless and extremely menacing!, i liked him lots. Emily Chu does what she has to do well as Kit's girlfriend, and was rather likable. Rest of the cast do fine. Overall Go see it now!. out of 5",
        "loc": null,
        "date": "2005-10-01"
    },
    "85": {
        "reliability": 0.33,
        "content": "A Better Tomorrow, early on, seems to start off maybe slightly sluggish, all-too-innocent perhaps. But the story of Kit, Ho, and Mark- two brothers and a best friend of the 'wrong-path' brother- once set into full gear becomes so emotional that one almost wonders is the strife between the characters, the tragedy woven in, might overpower the action. But as it turns out co-writer director John Woo fashions a kind of blend of the suave, instinctively stylish crime films of his idols Jean-Pierre Melville and Martin Scorsese, along with an above-average (even masterful) use of the men with guns kind of action picture. There's lots of blood and dead bodies to go along with the intensity of the three main characters, and at least two thirds of the film contain the best work Woo and his actors have ever done (on par with Woo's best film the Killer). It's not too hard to wonder how this set trends for years to come.Kit and Ho are brothers (Leslie Cheung and Ti Lung), one a cop and one a gangster. After the death of their father by way of the same crime syndicate Ho is involved in, Kit's whole mind-set is completely changed from the young, wannabe cop. Three years pass, as Ho's good if very unstable and scarred-from-battle- friend Mark (Chow Yun Fat in his truly breakthrough role), has lost his last power, whilst Ho is no longer on good terms with his brother and his former partners in crime. This leads up to a couple of enormous shoot-em-up sequences. What adds to the believability, and even un-conventionality of these sequences, is that Woo mixes around with what's expected. At times amazingly accurate gunmen like Mark do get injured and beat and shot, but it's through these wounds that his power increases; if he never got shot or hurt like some kind of Rambo he might not be as sympathetic. But Chow Yun Fat adds dimension to what could've been a standard supporting role; it's one of his seminal roles, in fact.And while Cheung here and there has a kind of blindness (and possibly one-sidedness) to how his brother has become more 'reformed', it ends up not being a crutch to the film like in other crime films. There is some dimension to his torn character, and the scene involving the death of his father is maybe my favorite non-Chow Yun Fat action scene in the film- it's not just a typical genre scene, it FEELS real. And Woo tends to add some surprises in his craftsmanship ala in the spirit of Scorsese. For example, I loved the way he uses slow-motion for an impact (i.e. before the shootout in the restaurant), or with the music especially. At times the soundtrack is typically, almost painfully (if enjoyably here and there) 80's, with the synthesizer and electronic beats, et all. But there are also great touches of classical, sorrowful musical parts with strings, using the themes for a much better emphasis than in a standard action film; the Ho brothers' work is even moving.So, would I recommend A Better Tomorrow for everyone? Probably not, at the end of the day it IS a genre film, with the drama and tragedy interwoven like many others in the almost overwhelming action set-pieces (the climax ALMOST goes too far). But for the genre fans, and especially for those looking to see the best that the 80's Honk Kong action genre has to offer, this and the Killer are definitely the best bets- there's even some unexpected twists of humor laced into some scenes, some more ridiculous than others.",
        "loc": "United States",
        "date": "2006-02-11"
    },
    "86": {
        "reliability": 0.0,
        "content": "Review: It's been years since I've seen this movie and I must admit, I didn't really enjoy it that much this time. Back in the day, I found John Woo's gun action quite amazing but after watching so many movies that have copied his style, it seems quite mediocre for this day and age. On top of that, the music throughout the movie was awful but the storyline made it quite an enjoyable watch. Anyway, best friends Sung Tse-Ho (Ti Lung) and Mark Lee (Chow Yun Fat), work for a triad gang who distribute counterfeit US bank notes. As Ho's brother is training to become a police officer, he keeps his criminal life secret but his sick dad is aware of his criminal activities and he keeps on asking him to go straight. He then takes on one last job in Taiwan but it turns out to be a trap and Ho and his new apprentice have to shoot there way out of an impossible situation. With the police hot on there tail, they go into hiding and a gang member attempts to kidnap Ho's dad to ensure his silence but when Ho's brother, Kit, tries to save his dad and his girlfriend, his dad gets shot and pleas with Kit to forgive his brother. Ho then surrenders to the police and goes to jail and when Mark hears about the gang who tried to trap Ho, he kills the leading Taiwanese gang member but he gets shot in his leg which leaves him crippled. After 3 years behind bars, Ho is released from prison and he attempts to go straight by becoming a driver for a taxi company. His brother, Kit, blames Ho for there father's death, so he doesn't want anything to do with him, especially as he wants to become a police officer and his brother is a ex- con. When Ho bumps in Mark, he's shocked to see that he has become an errand boy for the new head of the triads, Shing. Mark wants to get back there reputation by taking out Shing but Ho wants to go straight to try and get closer to his brother. Shing also tries to get Ho to come back to the organisation but when he turns down his offer, he uses brutal tactics by beating up Mark, attacking Ho's co-workers and luring Kit into a trap. After a passionate speech from Mark, Ho decides to take revenge on Shing and they put together a plan to steal a tape that will destroy there organisation. When Shing finds out about the missing tape they strike a deal to swap Kit for the incriminating tape but Shing's henchmen are close by, so Ho, Mark amp; Kit end up fighting for there life's whilst trying to take-out Shing. John Woo's story lines are always intense and never straight forward. I'm not surprised that it takes him so long to release a film! Anyway, the action seemed a bit messy at times but I liked it when Chow Yun-Fat was in his \"one man army\" mode. Ho's brother, Kit, did get on my nerves after a while but I liked the chemistry between Ho and Mark. There were a few emotional scenes and the complex storyline was well put together but I was hoping for some more action. Its still a decent film and definitely worth a watch if your into your John Woo movies. Watchable!Round-Up: This is John Woo's first movie which brought his name to light across the globe, even though it was full of subtitles. This also brought Chow Yun-Fat, 60, to an international market because of his brilliant performance and his cool persona. With over 100 movie to his name, which include Pirates of the Caribbean: At World's End, Bulletproof Monk, the international acclaimed Crouching Tiger Hidden Dragon and Anna and the King he's definitely a unique actor who doesn't get the recognition that he deserves. John Woo and Chow Yun-Fat always bring something special to the big screen and I'm looking forward to seeing more of there movies during my Oriental movie season.I recommend this movie to people who are into their action crime drama's starring Chow Yun-Fat, Lung Ti, Leslie Cheung, Waise Lee and Emily Chu. 4 10",
        "loc": "United Kingdom",
        "date": "2016-01-02"
    },
    "87": {
        "reliability": 0.2,
        "content": "Unfortunately John Woo has never done another Hard Boiled. A Better Tomorrow was a big disappointment for me, because I had expected a real stylish action packed film but it was not. The director is John Woo, it has Chow Yun Fat and the hype says it is action, but the movie was too slow paced again (like The Killer) and the action scenes (if it has any real one!) were not that great or unforgettable like the master's some other movies. The attack to the restaurant scene and the final part were remarkable, but that's all. The restaurant scene was pretty stylish, John Woo style, but it was too short. What about the high rating then? Well, I don't know. Unfortunately, the problem is not only lack of action, also the movie was not stylish as I had expected, the cinematography was just OK and I am sorry to say that, but it was not neither a first class film, nor an entertaining B movie. It was like a third class TV movie. Some people say that A Better Tomorrow and The Killer are John Woo's best movies and they are also \"art\". Simply, I disagree with that opinion. However, I am still hopeful that John Woo will be back one day and make movies like Hard Boiled.",
        "loc": "The Republic of Turkey",
        "date": "2009-12-20"
    },
    "88": {
        "reliability": 0.2,
        "content": "If you speak Japanese this might be a good show. It seems like it probably is. Unfortunately the English subtitles are completely unintelligible. You can more or less follow what's going on, but without the benefit of any dialog the movie falls flat for the English speaker. I don't understand why the even bothered to provide English subtitles if they weren't prepared to render at least a mediocre translation. I could only bear to watch the first 15 minutes or so. Of what I saw, the cinematography looked good, and the acting appeared passable. I would definitely be interested to see the film again if it were possible to understand.",
        "loc": "United States",
        "date": "2007-01-25"
    },
    "89": {
        "reliability": 0.38,
        "content": "As much as Woo fans would like to hype \"A Better Tomorrow\" as a classic, it is just another Hong Kong crime action flick with all the usual overdone bullets, blood, and silly melodrama. Just as with Jackie Chan, Jet Li and even Bruce Lee, this early Woo flick featuring early Chow Yuen Fat is a turkey made when Woo was cutting his teeth, before he got his rep and the juice to make bigger budget flicks. Just because this film bears the Woo signature, doesn't make it a good film. For Woo fans and action junkies only. (C)",
        "loc": "Orange County, CA  USA",
        "date": "2003-08-17"
    },
    "90": {
        "reliability": 0.0,
        "content": "A BETTER TOMORROW sees director John Woo and star Chow Yun-Fat single-handedly inventing the 'heroic bloodshed' genre that was to flourish in Hong Kong for the following decade. It's a tough, atmospheric and ultra-stylish story of gangsters and betrayal, of brotherhood and pain, and it's also not a patch on his later efforts.Okay, call me spoilt; I think HARD-BOILED and THE KILLER are the two greatest Woo Yun-Fat collaborations out there, and A BETTER TOMORROW is weak sauce in comparison to those movies. For starters, it's not an action film like those two; there are a couple of good scenes, but that's all you're going to get. Instead, there's a fair bit of overwrought melodrama instead, which is no substitute.In addition, Woo's direction just isn't as assured as it would be later in his career. There are one or two decent directorial flourishes, but A BETTER TOMORROW lacks the innate confidence that helped fuel the energy of his later productions. It's far from unwatchable: Yun-Fat and Lung contribute fine performances, for instance, but the storyline is muddled and the film as a whole only so-so. One for the dedicated fans, maybe: others should skip this and go straight to the best.",
        "loc": "United Kingdom",
        "date": "2013-05-07"
    },
    "91": {
        "reliability": 0.24,
        "content": "Maybe I'm way off base here. I love action films, including John Woo. But the VHS version of \"A Better Tomorrow\" I watched was muddy and the dubbing into English just left me confused. Who's doing what? They love each other but they're enemies? It left me feeling that the film was campy and overly melodramatic. At the same time, the action was not particularly interesting.Who should see this film:-- John Woo fans with nothing better to do on a rainy day, or even better, watch something else-- native Chinese speakers into John Woo-- nobody elseI'm surprised the film had such a high rating. Maybe the quality of the VHS dubbing ruined for me what was a fine film for others? I'll give \"A Better Tomorrow\" a rock bottom 3 out of 10. I couldn't get through it.",
        "loc": "United States",
        "date": "2004-05-22"
    }
}